{
  "categories": {
    "wisdom": {
      "rarity": "common",
      "fortunes": [
        "A calm mind hears what a busy mind cannot.",
        "The river does not drink its own water.",
        "Patience turns a seed into a forest.",
        "Silence often speaks the loudest truth.",
        "The tallest tree was once a buried seed.",
        "To understand the wind, let go of the kite.",
        "Every closed door teaches you to knock differently.",
        "A gentle answer can move a mountain of anger.",
        "Those who rush seldom notice the wildflowers.",
        "Still waters carve the deepest canyons.",
        "Knowing when to rest is its own form of strength.",
        "The mirror shows your face, not your worth.",
        "A half-listened lesson is a fully wasted one.",
        "Your shadow proves you are standing in the light.",
        "Not every storm comes to destroy; some clear the air.",
        "Wisdom is knowing which bridges to cross and which to build.",
        "The candle loses nothing by lighting another.",
        "An open hand receives more than a clenched fist.",
        "What bends in the wind outlasts what stands rigid.",
        "Yesterday's rain is today's flower.",
        "The smallest key can open the heaviest door.",
        "Worry is a rocking chair: it moves but goes nowhere.",
        "True clarity comes after you stop looking so hard.",
        "A lesson ignored is a lesson repeated.",
        "The eye that sees everything often overlooks itself.",
        "Planting kindness is never out of season.",
        "The wise traveler packs fewer opinions.",
        "Your greatest teacher is your last mistake.",
        "Shallow streams are the noisiest.",
        "Every ending writes the first line of a new story.",
        "A single thread can mend what seems torn apart.",
        "The fruit falls near the tree, but the seed travels far.",
        "What you hold too tightly, you crush.",
        "Peace is not the absence of noise but the presence of balance.",
        "A sharp tongue cuts the one who wields it most.",
        "Give time for the dust to settle before judging the road.",
        "The moon does not compete with the sun; each has its hour.",
        "To teach is to learn twice.",
        "Roots grow strongest where the soil is hardest.",
        "Understanding blooms when judgment fades.",
        "The first step looks small only to those who never took it.",
        "A question asked at the right time is worth ten answers.",
        "The deepest well was dug one shovelful at a time.",
        "You cannot see your reflection in boiling water.",
        "What you carry inside shapes what you see outside.",
        "Listening is a gift most people forget to give.",
        "A smooth sea never built a skilled sailor.",
        "The loudest voice rarely has the clearest message.",
        "Even the longest night ends with a sunrise.",
        "Trust the timing of seeds you have already planted.",
        "The bridge you refuse to burn may be the one you need tomorrow.",
        "Gratitude turns enough into abundance.",
        "Not all treasures glitter; some simply glow.",
        "When you stop chasing, the right things land.",
        "A single stone can change the course of a river.",
        "Humility is the doorway through which wisdom enters.",
        "The bird that sings at dawn trusted the night to end.",
        "Growth is quiet work that speaks loudly over time.",
        "The sky does not keep score of the clouds that pass.",
        "Kindness costs nothing but pays compound interest.",
        "A watched pot teaches patience to the impatient.",
        "The truth needs no decoration.",
        "Knowing yourself is the beginning of all direction.",
        "Old keys rarely open new doors.",
        "What others think of you is their story, not yours.",
        "A small light held high outshines a great fire far away.",
        "You cannot pour from an empty cup, but you can refill it.",
        "The path appears one step at a time.",
        "Arguing with a fool makes two.",
        "Sunlight reaches every corner if you open the blinds.",
        "A soft word can break a hard heart.",
        "Comparison steals what contentment offers freely.",
        "The oak sleeps inside every acorn.",
        "Rushing through pages does not mean you read the book.",
        "Good soil asks nothing but honest effort.",
        "Time reveals what haste conceals.",
        "Forgiveness is a gift you give yourself twice.",
        "The pen that hesitates still holds ink.",
        "Not every silence is empty; some are full of answers.",
        "The echo returns only what the voice sends out.",
        "A mountain is climbed not by staring at the peak but by watching each step.",
        "The net is knotted one loop at a time.",
        "Choose your words carefully; they become your footprints.",
        "A clear conscience is the softest pillow.",
        "The garden that feeds you was planted before the hunger.",
        "Even a broken clock finds its moment of truth.",
        "Do not mistake motion for progress.",
        "The lamp that lights the way burns from within.",
        "What you give away returns in unexpected forms.",
        "The lightest baggage makes the longest journey possible.",
        "Doubt is just curiosity wearing a disguise.",
        "The ladder of success is climbed rung by rung, not leap by leap.",
        "A stone thrown in anger always finds the wrong target.",
        "The map is not the territory; walk the land yourself.",
        "To know and not to act is not yet to know.",
        "A gentle correction outlasts a harsh punishment.",
        "What the caterpillar calls the end, the world calls a butterfly.",
        "The wise build fences around gardens, not around people.",
        "Your attention is the most valuable thing you own.",
        "A deep breath is the shortest prayer.",
        "Speak only if it improves upon the silence.",
        "The strongest walls are built with transparent bricks.",
        "What you resist persists; what you accept transforms.",
        "Every knot was once a straight piece of rope.",
        "The harvest depends on the seed, not the wish.",
        "Morning dew teaches that even small things can shine.",
        "The quietest rooms hold the richest conversations.",
        "A tree does not beg for sunlight; it simply grows toward it.",
        "The crack in the wall lets the light seep through.",
        "What you think you lack is often what you forgot you have.",
        "The answer you seek may be in the question you avoid.",
        "A river that tries to flow backward loses itself.",
        "Simplicity is the final achievement of wisdom.",
        "The best time to plant shade was twenty years ago; the next best is now.",
        "Your character is your only permanent outfit.",
        "Two ears and one mouth suggest a useful ratio.",
        "The fog always lifts for those who keep walking.",
        "Strength whispers; weakness shouts.",
        "The empty vessel makes the most noise, but carries the least.",
        "What you water will grow; choose carefully.",
        "A well-placed pause says more than a thousand words.",
        "The door you are afraid to open hides the room you need to enter.",
        "Perspective is the cheapest medicine.",
        "A compass is useless to someone who does not know they are lost.",
        "The pages of yesterday are for reading, not rewriting.",
        "Slow progress is still a thousand times faster than no progress.",
        "The kite flies highest against the wind, not with it.",
        "Your words should pass three gates: Is it true? Is it kind? Is it needed?",
        "The shadow cannot exist without light nearby.",
        "A cup must be empty before it can be filled anew.",
        "The truest mirror is an old friend.",
        "Not all detours are wrong turns.",
        "The hand that gives roses keeps the fragrance.",
        "Clarity follows confusion like dawn follows night.",
        "An unexamined opinion is just a borrowed thought.",
        "The roof was built on a rainy day's lesson.",
        "What you chase often runs; what you nurture stays.",
        "The ocean is made of single drops that chose to gather.",
        "Patience is trust dressed in work clothes.",
        "A single act of honesty outweighs a library of excuses.",
        "The stars do not compete for the sky; there is room for all.",
        "Let the soil rest, and it will reward you later.",
        "The strongest steel passes through the hottest fire.",
        "A narrow mind and a wide mouth often share the same face.",
        "What seems impossible today was once merely unthinkable.",
        "The arrow must be pulled backward before it flies forward.",
        "Simplicity is complexity resolved.",
        "A warm heart melts the coldest room.",
        "The clock has no favorite hour; treat each one equally.",
        "Not every path needs a destination to have value.",
        "The most useful door is often the plainest.",
        "Knowledge speaks in answers; wisdom speaks in questions.",
        "A candle does not lose brightness by being shared.",
        "The finest view comes after the steepest climb.",
        "Hold your plans loosely and your values firmly.",
        "The footprint you leave depends on the step you take.",
        "An ounce of practice outweighs a pound of theory.",
        "The window you clean today changes the view tomorrow.",
        "Let your actions be louder than your intentions.",
        "A fence built with trust needs no lock.",
        "The rain does not ask permission to nourish the field.",
        "What you learn in the valley prepares you for the peak.",
        "The best compass is a well-asked question.",
        "Every thread in the tapestry believes it holds the picture.",
        "Peace begins with a pause.",
        "The leaf that lets go of the branch finds the river.",
        "A steady flame outlasts a sudden blaze.",
        "True wealth is measured by what you do not need.",
        "The right word at the wrong time is still the wrong word.",
        "Every wall was once a single brick and a decision.",
        "A grateful heart is a magnet for small miracles.",
        "The sunrise does not hurry, yet it never arrives late.",
        "Growth and comfort rarely travel on the same road.",
        "The wiser you become, the less you need to prove.",
        "Not every anchor keeps you safe; some just keep you stuck.",
        "The shortest distance between two people is a shared laugh.",
        "Seeds planted in patience bloom in abundance.",
        "A quiet day is often the most productive one.",
        "The road that tests you is the one that teaches you.",
        "To see clearly, sometimes you must close your eyes.",
        "A life well-lived needs no monument.",
        "The tide obeys a rhythm deeper than the wind.",
        "What you overlook today may be tomorrow's cornerstone.",
        "The greatest journeys begin with honest uncertainty.",
        "Words once spoken are birds that never return to the cage.",
        "A bridge crossed in peace was built in difficult days.",
        "The sculptor sees the statue long before the marble falls away.",
        "Where attention goes, growth follows.",
        "A smooth pebble was once a rough stone with patience.",
        "The most important conversations happen without an audience.",
        "Every sunrise is an invitation you did not have to earn.",
        "The space between your thoughts is where wisdom lives.",
        "A good question can outlive a hundred good answers.",
        "The strongest roots are invisible.",
        "Time wasted worrying is time stolen from living.",
        "A well-built wall starts with a well-placed stone.",
        "The lantern that guides others still needs its own oil.",
        "Confusion is the doorstep of understanding.",
        "What you defend too fiercely may not be worth the fight.",
        "The river never complains about the bend it must take."
      ]
    },
    "love": {
      "rarity": "common",
      "fortunes": [
        "Love grows where attention flows.",
        "The heart knows shortcuts the mind has never mapped.",
        "A shared silence can be the deepest conversation.",
        "Love is not a destination; it is a way of traveling.",
        "The right person will feel like a deep breath after a long dive.",
        "Small gestures, repeated daily, build the grandest love stories.",
        "Two hearts in tune need no conductor.",
        "Love whispered is louder than affection shouted.",
        "The hand you hold today was once an open prayer.",
        "Vulnerability is the password to every real connection.",
        "A love that grows slowly rarely wilts.",
        "The warmest blanket is someone who believes in you.",
        "True love does not keep receipts.",
        "An unexpected kindness can rewrite someone's entire day.",
        "The best relationships are between two good forgivers.",
        "Love is the bridge that needs no engineering.",
        "The heart expands to fit everyone it welcomes.",
        "Falling in love is easy; rising in love is the real journey.",
        "A look that needs no words is worth every letter ever written.",
        "The roots of lasting love are watered with patience.",
        "Love does not divide; it multiplies.",
        "The longest embrace started with a single brave step forward.",
        "To love someone is to learn a new language without a textbook.",
        "The warmth you give returns as the warmth you feel.",
        "A kind word outlives the moment it was spoken.",
        "Love arrives not when you search for it but when you make room.",
        "Two people who choose each other daily build something unshakable.",
        "The softest touch can carry the strongest message.",
        "Love is the only fire that grows brighter when shared.",
        "You will find connection where you least expect to look.",
        "The heart that heals itself becomes the heart that heals others.",
        "Every great love begins with a small act of courage.",
        "A thoughtful note holds more value than a thousand gifts.",
        "Love is fluent in every silence.",
        "The people who stay through the storm deserve your sunshine.",
        "Laughter shared doubles; sorrow shared halves.",
        "Your presence is someone's favorite place to rest.",
        "Love does not demand perfection; it celebrates effort.",
        "The deepest bonds are forged through honest conversations.",
        "A genuine smile can travel across any distance.",
        "Love is not blind; it simply chooses to see with the heart.",
        "Every friend was once a stranger who chose to stay.",
        "Trust is the quiet foundation of every loud love.",
        "The greatest gift is the feeling of being truly understood.",
        "Love is listening when you would rather speak.",
        "A relationship watered with respect blooms in every season.",
        "The right words at the right moment can mend years of silence.",
        "Home is not a place; it is the arms that welcome you.",
        "To be loved exactly as you are is life's rarest luxury.",
        "A loyal heart is worth more than a brilliant mind.",
        "Love asks not what you can give but what you are willing to share.",
        "The threads of connection are strongest when woven gently.",
        "Someone is thinking of you right now with a smile.",
        "A love letter need not be written; sometimes it is cooked, built, or mended.",
        "The best conversations never watch the clock.",
        "You are someone's reason to believe in kindness.",
        "Love speaks most clearly through small, daily choices.",
        "The person who truly sees you is the mirror you never knew you needed.",
        "A garden of love needs weeding, not just watering.",
        "Gratitude between two people is the oxygen of their bond.",
        "The warmest memories are made on the most ordinary days.",
        "Love is not a trophy; it is a practice.",
        "A gentle touch can say what a thousand words cannot.",
        "Connection happens at the speed of vulnerability.",
        "The best part of any day is the voice that calls you home.",
        "Love is an anchor that lets you sail without drifting away.",
        "A single heartfelt apology can rebuild a broken bridge.",
        "Your kindness plants seeds in gardens you may never see.",
        "True closeness is being comfortable with the unfinished parts.",
        "Love is the only currency that increases when spent.",
        "The echo of a warm hug lasts longer than any word.",
        "Someone once wished for exactly the person you are.",
        "A relationship that allows growth will never outgrow itself.",
        "Love keeps no ledger but remembers every kindness.",
        "The quietest I love you is showing up when it matters.",
        "Comfort is someone who knows your story and still chooses to stay.",
        "Love does not arrive on schedule; it arrives on purpose.",
        "The heartbeat of a friendship is consistency.",
        "Your laughter is medicine for someone nearby.",
        "Love is brave enough to be honest and gentle enough to be kind.",
        "A cup of tea made for someone else tastes better than one made alone.",
        "The distance between strangers and soulmates is one honest conversation.",
        "To hold someone's hand is to hold their entire world for a moment.",
        "Love recognizes itself across crowded rooms and quiet years.",
        "The deepest love stories are written in margins, not headlines.",
        "A promise kept is worth more than a diamond given.",
        "Someone out there is the answer to a prayer you forgot you whispered.",
        "Love matures like wine; time only deepens its character.",
        "The strongest love does not cling; it trusts.",
        "Your softness is not weakness; it is someone's safest place.",
        "A shared meal is a love language every culture understands.",
        "Love is not about finding a perfect person but building a perfect bond.",
        "The best listeners are often the most loved.",
        "A small sacrifice made with love outweighs a grand gesture made from duty.",
        "True affection notices what the world overlooks.",
        "Love is the light that makes every color in your life brighter.",
        "Forgiveness in love is not forgetting; it is choosing forward.",
        "The space you make for someone in your life is the truest invitation.",
        "Old friends are like old wine: better with every passing year.",
        "Love grows best in the soil of mutual respect.",
        "A handwritten note holds more warmth than a hundred messages.",
        "You deserve the love you keep trying to give to everyone else.",
        "The kindest eyes have usually cried the most.",
        "Love is not a noun; it is a daily verb.",
        "Someone's world is brighter because you are in it.",
        "The right person calms storms they did not create.",
        "Love that is patient will outlast love that is passionate alone.",
        "A soft word can unlock the hardest heart.",
        "Your story is someone else's hope.",
        "The most important thing to bring to any relationship is your whole self.",
        "Love remembers the small things because the small things are the big things.",
        "A moment of eye contact can say what years of letters cannot.",
        "To be someone's peace in a noisy world is the highest honor.",
        "Love is the decision to show up even on the difficult days.",
        "The greatest romance is the one that makes you a better person.",
        "A relationship built on laughter has the strongest foundation.",
        "Love heals quietly, without asking for applause.",
        "The person who accepts your silence understands your soul.",
        "Every act of love sends ripples beyond what you can see.",
        "Someone's happiest memory includes your name.",
        "A heart that gives freely never runs empty.",
        "Love is not a fairytale; it is a choice repeated every morning.",
        "The warmest light in any room is the glow of genuine affection.",
        "To know someone deeply is the bravest and most beautiful journey.",
        "Love writes its best chapters when no one is watching.",
        "The most powerful three words are not spoken but lived.",
        "A friend who shows up unannounced brings the best kind of comfort.",
        "Love taught patience everything it knows.",
        "The fingerprints of love are found on the smallest details.",
        "Someone is proud of you in ways they have not yet said.",
        "A love that can laugh at itself will never break.",
        "Choosing someone daily is more romantic than any grand gesture.",
        "Love is the quiet certainty that you are not alone.",
        "The best relationships leave room for silence and space for growth.",
        "A sunrise shared is twice as beautiful.",
        "Love does not count the cost; it counts the moments.",
        "The most meaningful gifts cannot be wrapped.",
        "Your gentleness is someone's anchor in a restless sea.",
        "True love is two imperfect people choosing not to give up.",
        "A voice that says your name with tenderness is a kind of home.",
        "Love does not shout across canyons; it whispers across pillows.",
        "The bonds that last are not built on sparks but on steady warmth.",
        "Someone's prayer tonight includes your well-being.",
        "Love is learning the language of another heart.",
        "The simplest I miss you travels farther than any postcard.",
        "A love that allows breathing room never suffocates.",
        "You are the plot twist in someone's beautiful story.",
        "The warmth of a genuine hug rewrites the body's memory of loneliness.",
        "Love is the only argument where both sides can win.",
        "A friendship that survives distance was never measured in miles."
      ]
    },
    "career": {
      "rarity": "common",
      "fortunes": [
        "Your next breakthrough is one bold question away.",
        "The work you do today is the reputation you wear tomorrow.",
        "Opportunity often arrives dressed as hard work.",
        "A skill learned today is a door opened tomorrow.",
        "Success favors those who prepare quietly and act decisively.",
        "Your ideas have more value than you currently charge.",
        "The ladder to success is built one honest rung at a time.",
        "Small improvements, compounded daily, create extraordinary results.",
        "The meeting that changes everything might be your next one.",
        "Reliability is the most underrated superpower in any career.",
        "Your network is the net that catches your biggest opportunities.",
        "Excellence is a habit, not an event.",
        "The busiest person in the room is not always the most productive.",
        "A well-timed pivot beats a stubborn straight line.",
        "Your future self will thank you for the skill you start learning today.",
        "Every expert was once a beginner with the courage to look foolish.",
        "Clear communication is the shortcut most people overlook.",
        "The project you dread most often teaches you the most.",
        "An hour of focused work beats a day of scattered effort.",
        "Your career is a marathon with scenic detours, not a sprint.",
        "The best leaders serve the people who serve the mission.",
        "A good mentor saves you years you would have spent guessing.",
        "Deadlines are not enemies; they are the borders of creativity.",
        "Invest in yourself; the returns are always tax-free.",
        "The email you hesitate to send might be the one that matters most.",
        "Doing the work no one sees builds the career everyone notices.",
        "A fresh perspective is worth more than a polished resume.",
        "Your biggest competitor is yesterday's version of yourself.",
        "Collaboration multiplies what competition merely adds.",
        "The habit of finishing is rarer and more valuable than the gift of starting.",
        "A career built on integrity needs no advertising.",
        "The question you ask in the meeting may be the one everyone else was thinking.",
        "Show up early, stay curious, and leave things better than you found them.",
        "Your next opportunity is hiding in a problem everyone else is avoiding.",
        "Consistency outperforms talent that shows up only on good days.",
        "A setback at work is a setup for a stronger comeback.",
        "Learn to sell your ideas; brilliance without communication is invisible.",
        "The job you want often starts as the task you volunteer for.",
        "Patience in your career is not passive; it is strategic.",
        "Every no you hear brings you closer to the right yes.",
        "A thank-you note after a meeting costs nothing and earns everything.",
        "The skills that got you here are not the same skills that will take you further.",
        "Your attitude at work is your most visible credential.",
        "Growth happens in the gap between comfort and challenge.",
        "A professional who admits mistakes earns more trust than one who hides them.",
        "The side project you nurture today may become tomorrow's main act.",
        "Focus on problems worth solving, and the money follows.",
        "Your reputation enters the room before you do; make sure it smiles.",
        "The best negotiation begins with understanding the other side.",
        "Work smarter by learning which tasks to decline gracefully.",
        "A well-organized day is a well-spent life in miniature.",
        "The risk you do not take is the opportunity you will always wonder about.",
        "Leadership is not a title; it is a pattern of behavior.",
        "Your creativity is a muscle that strengthens with daily use.",
        "A career without learning is a car without fuel.",
        "The courage to start is often more important than the plan to finish.",
        "Your value increases with every problem you learn to solve.",
        "A professional who listens well negotiates better than one who argues well.",
        "The seed of your next promotion is hidden in today's extra effort.",
        "Details matter; the difference between good and great is often invisible to the careless eye.",
        "Build bridges in calm weather; you will need them in storms.",
        "Your biggest career asset is the ability to keep learning.",
        "Rest is part of the work, not a reward for it.",
        "A clear priority list is more powerful than a packed schedule.",
        "The feedback you resist is often the feedback you need most.",
        "Opportunities multiply as they are seized.",
        "A strong work ethic speaks louder than any interview answer.",
        "The project that scares you is the one that will stretch you.",
        "Your first draft does not need to be perfect; it just needs to exist.",
        "Professionalism is kindness applied to the workplace.",
        "The corner office matters less than the corner you own in your craft.",
        "A new skill is the best insurance policy for an uncertain economy.",
        "The people you help on your way up will remember you on their way up.",
        "Your calendar reveals your true priorities.",
        "A problem well-defined is a problem half-solved.",
        "The best pitch is the one that solves a real problem.",
        "Delegation is not weakness; it is multiplication.",
        "Your next role may require you to unlearn before you learn.",
        "A disciplined morning builds an exceptional afternoon.",
        "The quiet worker who ships consistently outshines the loud planner.",
        "Treat your to-do list as a promise to your future self.",
        "Your expertise is someone else's breakthrough waiting to happen.",
        "A team that trusts each other finishes faster than a team that merely works together.",
        "The gap in the market is often the skill no one else bothered to learn.",
        "Show your work; invisible effort gets invisible rewards.",
        "A well-asked question in a meeting is worth more than a well-made slide.",
        "Your career path does not need to be a straight line to reach the right place.",
        "The difference between busy and productive is intention.",
        "Every challenge at work is a chapter in your professional story.",
        "A solid reputation is built in years and tested in moments.",
        "The inbox will wait; the important work will not.",
        "Your greatest professional asset is adaptability.",
        "A brief pause before responding can save hours of correction.",
        "Success leaves clues; study the habits of those you admire.",
        "Your punctuality communicates respect before you say a word.",
        "The most important meeting is the one you have with your own goals each morning.",
        "A difficult boss is an advanced course in diplomacy.",
        "Your personal brand is what people say about you when you leave the room.",
        "The initiative you take today writes the reference letter of tomorrow.",
        "A great idea without execution is just an interesting thought.",
        "You are closer to a breakthrough than your doubt suggests.",
        "The market rewards those who solve problems others have not noticed.",
        "Your perseverance is being recorded even when no one is watching.",
        "A career pivot is not a failure; it is an upgrade in self-awareness.",
        "The most important contract you sign is the commitment to your own growth.",
        "Ask for the raise; your silence is not modesty, it is a discount.",
        "A mentor's shortest sentence can save your longest detour.",
        "Your focus determines your trajectory more than your talent.",
        "The most successful professionals are generous with credit.",
        "Today's preparation is tomorrow's opportunity.",
        "A portfolio of completed projects speaks louder than a resume of promises.",
        "Your comfort zone is a lovely place, but nothing grows there.",
        "The best networking happens when you stop networking and start helping.",
        "A small win today builds momentum for a big win tomorrow.",
        "Your next career chapter starts the moment you decide to turn the page.",
        "The feedback loop is your friend; shorten it whenever possible.",
        "A skill that makes you uncomfortable today will make you indispensable tomorrow.",
        "Your commitment to learning is the only job security that never expires.",
        "The meeting where you say nothing but listen to everything is never wasted.",
        "A clear goal is a magnet for the right opportunities.",
        "Your persistence has already outlasted many who quit too early.",
        "The market does not pay for effort alone; it pays for value delivered.",
        "A new perspective at work often starts with a new question.",
        "Your ambition is the compass; your discipline is the map.",
        "The Monday you dread may hold the lesson Friday celebrates.",
        "A professional who writes clearly thinks clearly.",
        "Your next breakthrough may come from outside your industry.",
        "The boldest move in your career may be asking for help.",
        "A single well-placed introduction can change your entire trajectory.",
        "Your willingness to be a beginner is your greatest professional advantage.",
        "The work you do for free often opens the door to the work that pays the most.",
        "A goal without a timeline is just a daydream with ambition.",
        "Your future employer is impressed by problems you have already solved.",
        "Every industry needs someone willing to challenge the obvious.",
        "A daily review of your progress is worth a monthly burst of panic.",
        "Your next great idea is waiting in the problem you have been ignoring.",
        "The best resume is a list of problems solved, not titles held.",
        "A professional who celebrates others' wins builds the strongest alliances.",
        "Your craft improves each time you choose quality over speed.",
        "The opportunity you are waiting for may be waiting for you to ask.",
        "A well-kept promise at work is worth more than a well-kept secret.",
        "Your dedication today is building the foundation of something remarkable.",
        "The simplest systems are often the most effective.",
        "A leader who asks for feedback earns more loyalty than one who demands obedience.",
        "Your next chapter professionally will surprise you in the best way.",
        "The habit of shipping imperfect work beats the habit of polishing in secret.",
        "A deep skill combined with broad curiosity creates an unstoppable career.",
        "The presentation you almost skipped might be the one that opens doors.",
        "Your handshake tells a story before your mouth does.",
        "A team that celebrates small wins builds the culture for big ones."
      ]
    },
    "humor": {
      "rarity": "rare",
      "fortunes": [
        "You will find what you are looking for in the last place you look. Obviously.",
        "Today is a good day to avoid making important decisions while hungry.",
        "A clean desk is a sign of a cluttered desk drawer.",
        "The fortune you really need is stuck to the bottom of someone else's cookie.",
        "Your socks will match today. Celebrate the small victories.",
        "You are not lost; you are on an unplanned adventure with poor cell service.",
        "Avoid taking life too seriously. No one gets out alive anyway.",
        "The answer to your question is yes. Unless the answer is no.",
        "You will step on a Lego in the dark but emerge stronger.",
        "Your hidden talent is hiding very well. Give it time.",
        "A watched inbox never delivers good news.",
        "The Wi-Fi signal will be strong wherever you are most productive.",
        "You will find money in a coat pocket you forgot existed.",
        "Someone will mispronounce your name today. Forgive them; they mean well.",
        "Today's horoscope: You will read a fortune cookie. Nailed it.",
        "The early bird gets the worm, but the second mouse gets the cheese.",
        "You are one witty comment away from being everyone's favorite person.",
        "Your spirit animal is a caffeinated squirrel.",
        "The odds of this fortune applying to you are surprisingly high.",
        "You will have a brilliant idea in the shower with no way to write it down.",
        "A nap is just a short vacation your brain books without asking.",
        "You will accidentally wave back at someone who was not waving at you.",
        "Somewhere, a dog is waiting to love you unconditionally.",
        "Your cooking is about to impress someone, possibly even yourself.",
        "Life is short. Eat the dessert first, but just this once.",
        "The snooze button is the most dangerous piece of technology you own.",
        "You will try to pull a push door. It happens to the best of us.",
        "Your autobiography should be titled: Mostly Winging It.",
        "Today you will send a text to the wrong person. Double-check before hitting send.",
        "A pizza is technically a real-time pie chart of how much pizza is left.",
        "You are approximately three compliments away from having a great day.",
        "Parallel parking will go unusually well for you this week.",
        "The universe is laughing with you, not at you. Probably.",
        "You will forget why you walked into a room, then remember after you leave.",
        "The gym misses you. Actually, the couch misses you more.",
        "Your dance moves are underappreciated by this generation.",
        "You will attempt a shortcut and it will take twice as long.",
        "Someone will ask for your advice and then do the opposite.",
        "Procrastination is just your brain's way of scheduling a panic-fueled miracle.",
        "You are overqualified for adulting but doing it anyway.",
        "Tomorrow you will do something mildly embarrassing. Embrace it.",
        "The pen you are looking for is behind your ear.",
        "You will successfully avoid a spoiler for something you care about.",
        "Your phone battery will last just long enough today. Barely.",
        "Karma has a sense of humor. Hope you are laughing along.",
        "You will have an argument with autocorrect and lose.",
        "Eating cereal for dinner is a valid life choice tonight.",
        "You will think of the perfect comeback three hours too late.",
        "A meeting that could have been an email is in your near future.",
        "Today is brought to you by caffeine and sheer determination.",
        "You will open the fridge, find nothing, and open it again in five minutes.",
        "The instructions say easy assembly. The instructions are optimistic.",
        "You will hum a song all day without knowing the actual lyrics.",
        "Expect a compliment from an unlikely source today.",
        "You are one good night of sleep away from solving all your problems. Maybe.",
        "Your plant is judging your watering schedule silently.",
        "Someone will like your joke today. It only takes one.",
        "A typo you did not notice has already been sent. Breathe.",
        "Your next great idea will arrive during the most inconvenient moment.",
        "The checkout line you choose will always be the slowest. This is the way.",
        "You will successfully assemble furniture with only two extra screws left over.",
        "Adulting is just Googling how to do things while pretending you already know.",
        "The algorithm knows you better than your best friend. Scary but true.",
        "You will drop your phone on your face while lying in bed. It builds character.",
        "Today's productivity level: aggressively mediocre. And that is okay.",
        "You will find a charger that fits on the first try. What a time to be alive.",
        "An awkward silence is just the universe giving everyone a chance to think.",
        "Your GPS will recalculate. Your patience will be tested.",
        "You are the main character, but the genre changes daily.",
        "A sock will vanish in the laundry. Accept the mystery.",
        "You will accidentally like a photo from three years ago. Scroll carefully.",
        "The printer senses your urgency and has chosen chaos.",
        "You will buy something on sale that you did not need. No regrets.",
        "An umbrella forgotten at home guarantees sunshine. You are welcome.",
        "You will eat one chip. Just kidding, you will eat the whole bag.",
        "Your next elevator ride will involve awkward small talk. Survive it.",
        "You will remember an important task at 2 a.m. Write it down.",
        "The self-checkout machine will need assistance. It always does.",
        "Your future holds at least one delightfully silly mistake.",
        "You will say see you later to someone you will never see again.",
        "Auto-correct will make you say something interesting today.",
        "You are in someone's phone as a funny contact name.",
        "The vending machine will cooperate on the first try this week.",
        "You will tell a joke and explain it, which will kill it. Classic.",
        "Life is like a group project: not everyone does their part.",
        "You will read this fortune and wonder if it was meant for you. It was.",
        "Traffic will clear the moment you consider an alternate route.",
        "The container lid you need is in a different drawer. It always is.",
        "Your indoor voice has been promoted to outdoor voice today.",
        "You will wave goodbye to someone walking the same direction as you.",
        "The test of your patience today will be a slow internet connection.",
        "You will look for your glasses while wearing them.",
        "A free sample at the grocery store will make your entire afternoon.",
        "You are somebody's favorite notification.",
        "Today, the right amount of hot sauce will be applied on the first try.",
        "Your next password will be one you actually remember. A rare feat.",
        "The plot twist of your week will be mild but amusing.",
        "Someone will hold a door open for you at the perfect distance: not too far, not too close.",
        "You will trip on a flat surface and pretend you were jogging.",
        "The mystery stain on your shirt will match your outfit. Silver lining.",
        "You will accidentally reply all. At least once.",
        "Your leftovers will taste even better tomorrow.",
        "An unexpected nap is heading your way. Do not fight it.",
        "The remote control is between the couch cushions. Always.",
        "You will yawn and make someone else yawn. Power move.",
        "A squirrel will judge you from a tree today. Let it.",
        "The recipe said 30 minutes. The recipe was lying.",
        "You will write a to-do list and immediately lose it.",
        "Your phone will autocorrect a word to something better than you intended.",
        "You are one accidental genius moment away from greatness.",
        "A grocery bag will rip at the worst time. Double bag your dreams.",
        "You will hear a song and think of a random memory from 2007.",
        "The weather forecast will be wrong in your favor today.",
        "You will rehearse a conversation that never happens.",
        "Your online shopping cart is judging your impulse control.",
        "A fly will enter your car and refuse to leave. Negotiation will fail.",
        "You will sneeze at an important moment. Bless you in advance.",
        "The first parking spot you see will be suspiciously perfect. Trust it.",
        "You will tell a story and forget the punchline. The journey was enough.",
        "Today, your hair will do that thing you like without any effort.",
        "You will over-pack for a trip and use three of the fifteen outfits.",
        "A coworker will bring snacks and your day will improve instantly.",
        "You will count something for no reason at all today.",
        "The crossword clue you are stuck on will come to you at midnight.",
        "You will hold a sneeze so hard your soul will leave briefly.",
        "The elevator will arrive as soon as you press the button. Witchcraft.",
        "You will say no problem and immediately encounter a small problem.",
        "Your laundry will fold itself. Just kidding. That is still on you.",
        "You will overthink a simple yes-or-no question.",
        "A bird will fly unusually close to your head today. It means nothing.",
        "The ice in your drink will conspire to splash your face.",
        "You will realize mid-story that your story is not interesting. Commit anyway.",
        "Your bedtime tonight: ambitious plans, actual result: scrolling.",
        "A door will open for you. A literal one. Someone is being polite.",
        "You will try to be productive and end up reorganizing a drawer.",
        "The sticker on the fruit will not come off cleanly. Accept it.",
        "You will start a diet on Monday. Which Monday is still undecided.",
        "Your best friend and your bed have something in common: both always support you.",
        "Today someone will ask you a question you Googled yesterday.",
        "You will sing in the car and briefly believe you are a rock star.",
        "The plastic wrap will not cooperate. It never does.",
        "You will step outside and immediately forget why.",
        "A bug will appear from nowhere and test your composure.",
        "You will consider going to bed early and then not.",
        "You will Google something simple and emerge two hours later an expert on something else.",
        "A group chat you muted will summon you back with exactly the right meme.",
        "You will put on pants today and feel accomplished. That counts.",
        "The USB will go in wrong twice before going in right. The prophecy holds.",
        "You will eat lunch at your desk and call it multitasking.",
        "Your cat respects you. Actually no. Your cat tolerates you. Close enough."
      ]
    },
    "motivation": {
      "rarity": "common",
      "fortunes": [
        "You are closer than you think. Keep going.",
        "The fire inside you is stronger than the storm around you.",
        "Today is the day you stop doubting yourself.",
        "Your effort is planting seeds the world has not seen bloom yet.",
        "The only limit you truly have is the one you accept.",
        "You have survived every difficult day so far. That is a perfect record.",
        "Dream big enough to scare yourself, then take the first step anyway.",
        "Your potential has not even introduced itself yet.",
        "The voice that says you cannot is lying.",
        "One more try is all that separates you from your goal.",
        "You are building something that matters. Do not stop now.",
        "Courage is not the absence of fear; it is the decision to move forward.",
        "The world needs exactly what you are creating.",
        "You did not come this far to only come this far.",
        "Difficult roads often lead to the most beautiful destinations.",
        "Your consistency will outperform everyone else's intensity.",
        "Wake up with determination. Go to bed with satisfaction.",
        "The universe is rearranging itself for your next chapter.",
        "You are not behind; you are on your own timeline.",
        "Every great achievement was once considered impossible.",
        "Your belief in yourself is the most powerful tool you own.",
        "Start before you are ready. Adjust as you go.",
        "The doubt you feel is proof that you are pushing boundaries.",
        "You have permission to be both a work in progress and a masterpiece.",
        "The finish line is just the start of a new race. Run joyfully.",
        "Your strength is not measured by what you carry but by what you overcome.",
        "Act as if it is impossible to fail, then prove yourself right.",
        "Small daily improvements are the key to staggering long-term results.",
        "You are the author of your story. Write a chapter worth reading today.",
        "Discomfort means you are growing. Lean into it.",
        "There is no elevator to success. Enjoy the stairs.",
        "Your dreams are valid even when others cannot see them.",
        "The best project you will ever work on is yourself.",
        "Fall seven times. Rise eight. You already know how.",
        "Today is not just another day; it is a new opportunity to be remarkable.",
        "You have the power to turn your wounds into wisdom.",
        "Success is rented, and the rent is due every single day.",
        "Your comeback is always stronger than your setback.",
        "Doubt kills more dreams than failure ever will.",
        "You are braver than you believe and stronger than you seem.",
        "The gap between where you are and where you want to be is called effort.",
        "Champions are made when no one is watching.",
        "Stop waiting for the perfect moment. Take this moment and make it perfect.",
        "You are the storm, not the ship tossed by it.",
        "Progress is progress, no matter how small the step.",
        "Your hardest days are often your most defining.",
        "Do it now. Your future self will thank you.",
        "You are one decision away from a completely different life.",
        "The mountain you have been climbing is about to reveal its view.",
        "Discipline is choosing between what you want now and what you want most.",
        "Your potential is endless. Go do what you were created to do.",
        "Winners are not people who never fail; they are people who never quit.",
        "Each sunrise brings a new chance to rewrite your story.",
        "You are not a drop in the ocean; you are the entire ocean in a drop.",
        "The struggle you face today is developing the strength you need tomorrow.",
        "Believe in the power of yet: you have not achieved it yet.",
        "You have within you right now everything you need to succeed.",
        "Setbacks are just setups for greater comebacks.",
        "Your future is created by what you do today, not tomorrow.",
        "Be so good they cannot ignore you.",
        "Every master was once a disaster. Keep practicing.",
        "The only way to guarantee failure is to never begin.",
        "You are one bold move away from the life you imagined.",
        "Temporary discomfort creates permanent results.",
        "Your persistence is your greatest talent.",
        "Make today so awesome that yesterday gets jealous.",
        "The version of you that takes action is the version that wins.",
        "You are not waiting for a miracle; you are the miracle.",
        "Energy flows where intention goes.",
        "The pain you feel today is the strength you feel tomorrow.",
        "Your ambition is contagious. Spread it everywhere.",
        "Everything you have ever wanted is on the other side of fear.",
        "You will look back on this moment as the turning point.",
        "A goal is a dream with a deadline. Set yours today.",
        "No rain, no flowers. No effort, no reward.",
        "You are stronger than your excuses.",
        "The harder the battle, the sweeter the victory.",
        "Your next level requires a new version of you.",
        "Every champion was once a contender who refused to give up.",
        "The magic you are looking for is in the work you are avoiding.",
        "You are not stuck. You are just preparing for a quantum leap.",
        "What feels like slowness is actually building your foundation.",
        "Your determination has already outlasted most people's enthusiasm.",
        "Prove them wrong. Quietly and effectively.",
        "The obstacles you face are the weights that build your strength.",
        "Your breakthrough does not require permission from anyone.",
        "Action cures fear. Take one step right now.",
        "You are the reason someone else dares to dream.",
        "The grind you resent today is the glory you celebrate tomorrow.",
        "Stop shrinking to fit places you have outgrown.",
        "You were not born to be average. Act accordingly.",
        "The timing will never be perfect. Begin anyway.",
        "Your tenacity is writing a story that others will want to read.",
        "Every day you choose to continue is a day you choose to win.",
        "You are tougher than your toughest day.",
        "The world makes room for people who know where they are going.",
        "Your only competition is the person you were yesterday.",
        "The path may be winding, but every step takes you forward.",
        "You carry the spark. Now light the fire.",
        "Success is built on a pile of lessons learned from failure.",
        "You are not too late. You are right on time for your journey.",
        "What seems hard today will be your warm-up tomorrow.",
        "Your commitment today shapes the landscape of your tomorrow.",
        "Stand tall even when the wind tries to push you down.",
        "The best revenge is a life lived at full volume.",
        "You have outgrown ceilings before. This one is no different.",
        "Trust the process even when you cannot see the progress.",
        "Your story is not over. The best chapters are ahead.",
        "Be the energy you want to attract.",
        "Every sunrise whispers: try again.",
        "You are rewriting the rules by showing up every single day.",
        "The dream is free; the hustle is sold separately.",
        "Today's effort is tomorrow's evidence.",
        "You are not lost; you are exploring.",
        "The breakthrough is one uncomfortable conversation away.",
        "Inhale confidence. Exhale doubt.",
        "You have a 100% success rate at surviving bad days.",
        "The power to change your life is already in your hands.",
        "Aim so high that your doubts need binoculars.",
        "You are not running late; you are running on your own clock.",
        "The road is long, but your legs are strong.",
        "Today you take one step. Tomorrow you take another. That is how mountains move.",
        "You were made for this moment. Own it.",
        "Pressure creates diamonds. You are becoming one.",
        "The world bends for those who push with consistent effort.",
        "Your name will be on the list of those who did not give up.",
        "Every effort counts, even the ones you do not notice.",
        "You are the project worth investing in.",
        "The seeds of extraordinary results are ordinary daily habits.",
        "Keep showing up. The universe is taking notes.",
        "Your grit has already earned respect you have not heard about yet.",
        "The best view comes after the climb you almost gave up on.",
        "What is coming is better than what is gone.",
        "You have already proven you can do hard things.",
        "The courage to begin again is the courage that changes everything.",
        "Your potential is a well that never runs dry.",
        "Today, do something your future self will be proud of.",
        "The light at the end of the tunnel is not an illusion. Walk toward it.",
        "You are stronger than any excuse your mind invents.",
        "Success is not loud; it is the quiet refusal to quit.",
        "The version of you that survives this becomes unstoppable.",
        "Begin today. Not tomorrow. Not Monday. Today.",
        "Your effort is someone else's inspiration.",
        "You are on page one of a chapter that changes everything.",
        "The only failure is the failure to try.",
        "Rise. Every single time.",
        "You are already enough. Now go prove it to yourself.",
        "The setback was the setup. Now watch the comeback.",
        "Your discipline on the quiet days builds your triumph on the loud ones.",
        "The wall between you and your goal is made of paper. Push through it."
      ]
    },
    "philosophy": {
      "rarity": "rare",
      "fortunes": [
        "The self that observes the self is never fully seen.",
        "Time is the only currency you spend without choosing to.",
        "Every certainty is just a doubt that stopped asking questions.",
        "The universe is under no obligation to make sense to you.",
        "You are both the sculptor and the clay.",
        "Meaning is not found; it is constructed.",
        "The boundary between chaos and order is where creation lives.",
        "If nothing is permanent, then loss is just change with a heavy coat.",
        "To define something is to set its first limit.",
        "The present moment is the only place that exists.",
        "Identity is the story you tell yourself until you believe it.",
        "The void is not empty; it is full of potential.",
        "Freedom is not the absence of constraint; it is the choice of which constraints to accept.",
        "You cannot step into the same river twice, nor can you be the same person twice.",
        "Consciousness is the universe experiencing itself through your eyes.",
        "Every ending contains the blueprint of a beginning.",
        "The map you draw of reality becomes the reality you walk through.",
        "Paradox is the language the truth speaks when logic is too small.",
        "Time does not pass; you pass through it.",
        "A thought about a thought is still just a thought.",
        "The observer changes the observed simply by looking.",
        "What you call the self is a river pretending to be a stone.",
        "Every answer is a question that has temporarily stopped asking.",
        "Emptiness is the space that makes fullness possible.",
        "To be alive is to participate in the universe thinking about itself.",
        "The horizon moves as you move; that is its purpose.",
        "Your experience of the world is a translation, never the original text.",
        "Silence is not the absence of sound but the presence of attention.",
        "Existence is the one experiment you cannot observe from outside.",
        "Every choice creates a universe where the other choice was made.",
        "You do not have a life; you are life.",
        "The question why has no bottom.",
        "Memory is imagination facing backward.",
        "The more you define yourself, the less room you leave for becoming.",
        "Reality is what remains when you stop believing in it.",
        "Every word is a box that cannot hold the fullness of what it names.",
        "The space between two thoughts is where you truly exist.",
        "Nothing is wasted in the economy of the universe.",
        "You are the question the universe is asking itself.",
        "What you perceive as now has already become then.",
        "Certainty is a destination for those tired of traveling.",
        "The present is the only tense that actually exists.",
        "A universe that contains a mind contemplating it is stranger than any fiction.",
        "The edge of your understanding is the border of your world.",
        "Change is the only thing that has never changed.",
        "Your awareness is the stage, not the play.",
        "To name a thing is to separate it from the whole.",
        "The distinction between inside and outside dissolves under close examination.",
        "Every truth is a half-truth seen from only one angle.",
        "The moment you grasp the present, it has already slipped into the past.",
        "You are a pattern that the universe repeats and revises.",
        "The question itself is often more valuable than its answer.",
        "Perspective is not a lens; it is the eye.",
        "Nothing exists in isolation; everything is relation.",
        "The universe is not something that happened once; it is something that is happening now.",
        "To understand fully is to realize how much you do not understand.",
        "The most real thing about you is the thing you cannot measure.",
        "Language describes reality the way a net catches water.",
        "You are always both the painter and the painting.",
        "Suffering is resistance to what is already here.",
        "The line between observer and participant was always imaginary.",
        "What you call a thing shapes what a thing becomes.",
        "Time is the mind's way of keeping everything from happening at once.",
        "The universe does not hurry, yet everything is accomplished.",
        "You are a verb disguised as a noun.",
        "Every moment is the edge between memory and anticipation.",
        "The more you zoom in, the less the boundary holds.",
        "Your sense of I is the universe looking through a keyhole.",
        "Truth is the shadow that different lights cast differently.",
        "Simplicity is complexity in its most elegant disguise.",
        "To know that you do not know is the highest form of knowledge.",
        "The whole contains the part, and the part contains the whole.",
        "Meaning exists in the space between words, not in the words themselves.",
        "You are the process, not the result.",
        "The opposite of a great truth is another great truth.",
        "Every structure carries within it the seeds of its own dissolution.",
        "The act of looking for meaning gives meaning to the looking.",
        "A thing and its opposite often share the same root.",
        "Awareness is the only light that never casts a shadow.",
        "You are always arriving at the place you never left.",
        "The deepest freedom is the freedom from the need to be free.",
        "What you seek is already watching you.",
        "The universe is not made of atoms; it is made of stories.",
        "Every fact is an interpretation that has forgotten it is one.",
        "The gap between what is and what could be is called imagination.",
        "Form is emptiness wearing a costume.",
        "You are the space in which experience unfolds.",
        "The unknown is not the enemy; it is the frontier.",
        "Every mirror shows a world that only you can see.",
        "To let go is not to lose; it is to stop carrying.",
        "The beginning of wisdom is the willingness to be uncertain.",
        "The thread that connects all moments is attention.",
        "Every ending is a door disguised as a wall.",
        "The only real journey is inward.",
        "What the eye sees depends on what the mind has learned to look for.",
        "You are both the canvas and the brush.",
        "The nature of light is that it reveals and conceals simultaneously.",
        "Existence does not explain itself; it simply continues.",
        "The silence between notes is what makes music possible.",
        "All boundaries are invented; the territory is seamless.",
        "You are a temporary arrangement of eternity."
      ]
    },
    "adventure": {
      "rarity": "epic",
      "fortunes": [
        "A journey of a thousand miles begins with a single curious glance at a map.",
        "Your next great story starts the moment you say yes to the unknown.",
        "The compass in your chest points toward experiences, not places.",
        "Somewhere out there, a road is waiting to change your name.",
        "Pack your courage first; everything else fits around it.",
        "The best souvenirs are the ones that live in your memory, not your suitcase.",
        "A detour is just an adventure that forgot to tell you it was one.",
        "The world is a book, and every trip turns a new page.",
        "Wander often. Wonder always.",
        "Your comfort zone has an expiration date. Check it.",
        "The trail that scares you is the one worth hiking.",
        "An unplanned day can become an unforgettable story.",
        "The horizon is not a boundary; it is an invitation.",
        "You are one plane ticket away from a completely different perspective.",
        "The wildest adventures begin with the quietest decisions.",
        "Every new place you visit adds a color to your soul.",
        "Lost is just another word for discovering something you did not know existed.",
        "The mountains are calling, and your legs are ready.",
        "A map is a promise of places that are waiting to know your footsteps.",
        "The most beautiful sunsets are seen from unfamiliar hills.",
        "Your passport is a collection of doors you dared to open.",
        "Sometimes the road chooses you. Let it.",
        "Adventure is not recklessness; it is curiosity with walking shoes.",
        "The next corner you turn might hold the memory of a lifetime.",
        "Travel light, dream heavy.",
        "Your life expands at the exact rate you explore.",
        "The campfire you build tonight will warm stories for decades.",
        "A foreign language is just a familiar thought dressed differently.",
        "The greatest discoveries happen off the beaten path.",
        "Leave enough room in your plans for magic to find you.",
        "The ocean does not care about your schedule. Dive in anyway.",
        "Every summit was once an intimidating view from below.",
        "You will eat a meal in a place you have never heard of, and it will change you.",
        "The cave you fear to enter holds the treasure you seek.",
        "New coordinates, new version of you.",
        "The sound of departure is the overture to every great story.",
        "A sunrise in a new city rewires your sense of possibility.",
        "The bravest thing you can do is book the trip you keep postponing.",
        "Some roads are meant to be walked slowly and remembered forever.",
        "Your feet were made for trails that do not exist on any app.",
        "Adventure whispers; routine shouts. Choose what you listen to.",
        "The world rewards those who leave the guidebook at home occasionally.",
        "A tent under the stars is a cathedral no architect could design.",
        "The wind carries stories from places you have not been yet.",
        "Every stranger in a new land is a potential lifelong friend.",
        "The rapids ahead are not obstacles; they are the ride.",
        "A ship in the harbor is safe, but that is not what ships are for.",
        "The best photos are the ones you forget to take because you were living.",
        "Adventure does not require a passport; sometimes it only requires a different turn.",
        "The edge of the map is where the best stories begin.",
        "Your next destination is already dreaming about your arrival.",
        "Nature does not charge admission. Step outside.",
        "The path less traveled is overgrown because it is saving itself for you.",
        "A backpack and a question mark: that is all any adventure needs.",
        "Every river you cross carries away a fear you no longer need.",
        "The world is wider than your worry allows. Go see for yourself.",
        "A night sky in the wilderness recalibrates everything you thought was big.",
        "You will find yourself in a place where the only clock is the sun.",
        "The first step of an adventure is never the hardest; it is the most exciting.",
        "A foreign market holds spices, stories, and surprises in equal measure.",
        "The road does not end; it just changes its name.",
        "You are one conversation with a local away from the real experience.",
        "Somewhere a waterfall is rehearsing its performance just for your visit.",
        "Adventure is the antidote to a life lived on repeat.",
        "The view from the top includes everything you doubted along the way.",
        "A bridge between two cultures is built by crossing it.",
        "Your future self is exploring a place your current self has never imagined.",
        "The forest has a rhythm. Go listen.",
        "Collect moments, not coordinates.",
        "Every new skyline is a pencil sketch of what your life could look like.",
        "The tide does not wait for the cautious. Wade in.",
        "Somewhere between departure and arrival, you become someone new.",
        "The best adventures are the ones that change your questions, not just your scenery.",
        "A road trip is a moving meditation with better snacks.",
        "The world is too round to have corners you cannot explore.",
        "Your sense of wonder is the most reliable compass you own.",
        "A winding path is just a straight path that knows how to enjoy itself.",
        "The distance between ordinary and extraordinary is one brave yes.",
        "Your adventure begins the moment you close the front door behind you.",
        "The unknown is not a wall; it is a wide-open field."
      ]
    },
    "mystery": {
      "rarity": "legendary",
      "fortunes": [
        "The door you never opened was never locked.",
        "Something you lost long ago is closer than you think.",
        "The number you keep seeing is not a coincidence.",
        "A stranger already knows the answer you have been seeking.",
        "The reflection blinked before you did.",
        "What you buried will bloom in an unexpected garden.",
        "The clock stopped at that hour for a reason only you can decode.",
        "Someone is dreaming of a place that looks exactly like your childhood room.",
        "The book you have not read yet contains your name on page forty-seven.",
        "A letter meant for you was delivered to the wrong century.",
        "The stars rearranged themselves last night. Did you notice?",
        "Your shadow remembers places you have never been.",
        "The answer is hidden in the question you are afraid to ask.",
        "A sound you heard as a child is trying to reach you again.",
        "The key in your pocket opens a door you have not found yet.",
        "What watches you from the corner of your eye is just your future arriving early.",
        "The map folds differently each time you open it.",
        "A song playing in another room was written about a dream you had last week.",
        "The word you cannot remember is the word that remembers you.",
        "Something old woke up when you read this.",
        "The path you walk at night is not the same path you walk by day.",
        "A coin you once dropped is still spinning somewhere.",
        "The echo you hear has traveled further than any voice.",
        "Someone left a message in a language you will learn next year.",
        "The candle flickers not from wind but from a breath in another time.",
        "You have been here before, but the furniture has moved.",
        "A photograph you have not taken yet already exists in someone's album.",
        "The dream you forgot this morning was more real than you know.",
        "The pattern in the clouds is a sentence that only the patient can read.",
        "An old door in a new building is waiting for your hand.",
        "The silence you hear is actually a very old conversation.",
        "Something you wrote as a child will make sense to you very soon.",
        "The compass does not point north for everyone.",
        "A window left open in your memory is letting something new in.",
        "The bird that follows you is not the same bird each time.",
        "Someone you have not met yet already recognizes your voice.",
        "The thread you pulled did not unravel a sweater; it opened a curtain.",
        "The page between chapters is where the real story hides.",
        "Your fingerprint matches a fossil no one has found yet.",
        "The rain tonight carries a message meant only for open windows.",
        "A clock you do not own is counting down to something wonderful.",
        "The mirror shows Monday's face on a Sunday night.",
        "Someone carved your initials into a tree that has not grown yet.",
        "The next stranger you meet has already met you somewhere you cannot recall.",
        "A lighthouse you have never seen has been guiding you all along.",
        "The stones on the path rearrange themselves after you pass.",
        "A voice in the wind is spelling your name one letter per breeze.",
        "The last page of a book you love secretly changes each time you read it.",
        "Something is about to arrive that you ordered in a dream.",
        "The constellation above your birthplace tells a joke only the moon understands."
      ]
    }
  }
}
