{
  "daily": {
    "date": "2026-02-22",
    "horoscopes": {
      "aries": {
        "text": "Mars charges through your communication sector today, igniting passionate conversations and bold declarations. Your natural leadership shines brightest when you temper enthusiasm with active listening. A surprising collaboration could emerge from an unexpected source this winter afternoon.",
        "love": 4,
        "career": 5,
        "health": 3,
        "luckyNumber": 17,
        "luckyColor": "crimson",
        "mood": "energetic"
      },
      "taurus": {
        "text": "Venus whispers gently about financial matters and self-worth today, encouraging you to review your resources with fresh eyes. This introspective winter season asks you to plant seeds for spring abundance rather than rush decisions. Trust your instincts when an opportunity seems too good to be true.",
        "love": 3,
        "career": 3,
        "health": 4,
        "luckyNumber": 42,
        "luckyColor": "emerald",
        "mood": "grounded"
      },
      "gemini": {
        "text": "Mercury's alignment brings clarity to foggy situations that have troubled you lately. Your curiosity leads you down fascinating rabbit holes today—embrace the journey of learning something completely new. Social connections sparkle this evening, so don't retreat into your winter shell too quickly.",
        "love": 4,
        "career": 4,
        "health": 3,
        "luckyNumber": 23,
        "luckyColor": "electric blue",
        "mood": "curious"
      },
      "cancer": {
        "text": "The Moon's tender influence asks you to nurture yourself as generously as you care for others. Winter introspection reveals an emotional pattern ready to be released—you've carried it long enough. Create cozy moments at home where vulnerability feels safe and healing can truly begin.",
        "love": 5,
        "career": 2,
        "health": 4,
        "luckyNumber": 8,
        "luckyColor": "seafoam",
        "mood": "reflective"
      },
      "leo": {
        "text": "The Sun illuminates your relationship sector, reminding you that true confidence includes admitting when you need support. Your warmth melts winter's chill for everyone around you today. A creative project gains momentum when you collaborate rather than commanding the spotlight alone.",
        "love": 4,
        "career": 4,
        "health": 5,
        "luckyNumber": 31,
        "luckyColor": "gold",
        "mood": "confident"
      },
      "virgo": {
        "text": "Mercury's precision helps you organize the chaos that's been accumulating in your daily routines. Today's perfect for tackling that project you've been mentally preparing for all winter. Remember that perfection is the enemy of progress—your 80% is everyone else's 100%.",
        "love": 2,
        "career": 5,
        "health": 3,
        "luckyNumber": 54,
        "luckyColor": "navy",
        "mood": "focused"
      },
      "libra": {
        "text": "Venus dances through your creative zone, awakening artistic impulses you'd tucked away during winter's demands. Balance beckons in a relationship where you've been giving more than receiving. Harmony arrives not from avoiding conflict but from speaking your truth with grace.",
        "love": 3,
        "career": 3,
        "health": 4,
        "luckyNumber": 66,
        "luckyColor": "lavender",
        "mood": "harmonious"
      },
      "scorpio": {
        "text": "Pluto's transformative energy stirs deep within, urging you to shed an old version of yourself like a winter coat you've outgrown. Trust the intensity of your intuition today—it sees what others miss. A private conversation holds the key to resolving a mystery that's been haunting you.",
        "love": 4,
        "career": 4,
        "health": 3,
        "luckyNumber": 13,
        "luckyColor": "maroon",
        "mood": "intense"
      },
      "sagittarius": {
        "text": "Jupiter expands your horizons even as winter asks you to stay grounded—find adventure in philosophical exploration today. Your optimism is contagious, lifting spirits wherever you go. A learning opportunity disguises itself as a casual conversation, so keep your mind open to wisdom from unexpected teachers.",
        "love": 3,
        "career": 4,
        "health": 5,
        "luckyNumber": 77,
        "luckyColor": "orange",
        "mood": "adventurous"
      },
      "capricorn": {
        "text": "Saturn rewards your winter resilience with tangible progress toward your long-term goals. Today's small step feels minor but builds the foundation for monumental success. Allow yourself a moment of satisfaction—you've earned recognition even if you're too modest to seek it.",
        "love": 2,
        "career": 5,
        "health": 4,
        "luckyNumber": 88,
        "luckyColor": "charcoal",
        "mood": "ambitious"
      },
      "aquarius": {
        "text": "Uranus sparks brilliant insights that solve problems others haven't even identified yet. Your innovative spirit thrives in winter's quiet contemplation, birthing ideas for spring implementation. Community connections surprise you with their depth—you're not as alone in your vision as you sometimes feel.",
        "love": 3,
        "career": 4,
        "health": 3,
        "luckyNumber": 11,
        "luckyColor": "silver",
        "mood": "innovative"
      },
      "pisces": {
        "text": "Neptune's dreamy influence heightens your already powerful intuition to extraordinary levels today. Winter's introspection suits your sensitive soul—use this time to journal, meditate, or create art that channels your emotions. A spiritual revelation arrives through the most ordinary moment if you're paying attention.",
        "love": 5,
        "career": 2,
        "health": 4,
        "luckyNumber": 29,
        "luckyColor": "teal",
        "mood": "intuitive"
      }
    }
  },
  "weekly": {
    "weekOf": "2026-02-22",
    "horoscopes": {
      "aries": {
        "overview": "Mars squares Neptune this week, creating tension between your desire for immediate action and the need for strategic patience. The late winter energy asks you to channel your natural fire into careful planning rather than impulsive charges forward.",
        "love": "Venus in harmonious aspect to your sign brings warmth to connections, though the Neptune square warns against idealizing potential partners. Singles may find intrigue in mysterious encounters that require time to fully understand.",
        "career": "Professional ambitions meet frustrating delays as Mars-Neptune creates confusion around next steps. Use this friction productively by refining your vision rather than forcing premature progress.",
        "advice": "Embrace the discomfort of waiting; your warrior spirit grows stronger through disciplined restraint. Channel restless energy into detailed preparation for spring's opportunities."
      },
      "taurus": {
        "overview": "Venus, your ruling planet, forms a supportive trine with stabilizing Saturn, offering you solid ground in uncertain times. This winter week rewards your natural inclination toward patience and practical assessment of resources.",
        "love": "The Venus-Saturn aspect deepens existing commitments and brings clarity about what you truly value in partnership. Those seeking love should trust that slow-building connections have the most enduring potential.",
        "career": "Financial matters and professional structures receive cosmic support, making this an excellent time to negotiate contracts or establish long-term plans. Your reputation for reliability opens doors that flash-in-the-pan talent cannot access.",
        "advice": "Trust your instinct to move slowly and deliberately; the tortoise truly does win this race. Invest in quality over speed in all endeavors."
      },
      "gemini": {
        "overview": "Mercury stations retrograde in your communication sector, turning your usually outward focus inward for reflection and revision. The winter introspection period intensifies, asking you to review ideas rather than broadcast them.",
        "love": "Conversations may circle back to unresolved themes from the past as Mercury retraces its steps. This revisitation offers healing opportunities if you approach old wounds with new wisdom.",
        "career": "Expect delays in contracts, miscommunications in meetings, and the need to double-check all details. Rather than frustration, treat this as cosmic permission to perfect your pitch before the spring launch.",
        "advice": "Embrace the pause as gift rather than obstacle; your quick mind benefits from occasional slowdowns. Use this time to listen more than you speak."
      },
      "cancer": {
        "overview": "The Moon's nodes shift, activating your relationship axis and signaling a year-long journey of redefining how you balance self-care with caring for others. This week's lunar aspects heighten your already keen emotional sensitivity.",
        "love": "Deep conversations about needs and boundaries become essential as the nodal shift begins its work. Vulnerability feels risky but necessary for authentic connection to flourish.",
        "career": "Professional partnerships require honest dialogue about roles and expectations. Your intuitive read of group dynamics proves invaluable for navigating shifting team structures.",
        "advice": "Protect your energy without building walls; discernment is different from defensiveness. Your resilience grows through acknowledging limits, not ignoring them."
      },
      "leo": {
        "overview": "The Sun forms a productive sextile with Jupiter, amplifying your natural confidence and drawing opportunities toward your warmth. Even in winter's quieter energy, your light finds ways to shine through.",
        "love": "Generosity of spirit attracts admiration, though you must ensure reciprocity exists beneath the flattery. Existing relationships benefit from grand gestures that demonstrate your commitment.",
        "career": "Leadership opportunities emerge as others recognize your ability to inspire during challenging times. A mentor or authority figure may offer expansion possibilities worth serious consideration.",
        "advice": "Your radiance is most powerful when tempered with humility and genuine interest in others' contributions. Shine with, not above, your collaborators."
      },
      "virgo": {
        "overview": "Mercury retrograde in your partnership zone demands revision of agreements and reconsideration of collaborations. Your analytical gifts are perfectly suited to this detail-oriented review process.",
        "love": "Previous relationship patterns resurface for examination—pay attention to recurring themes rather than specific incidents. Healing comes through understanding the root, not just treating symptoms.",
        "career": "Projects require refinement before moving forward, which actually plays to your perfectionist strengths. What others see as setback, you recognize as opportunity for improvement.",
        "advice": "Release the need to fix everything immediately; some problems solve themselves through patient observation. Your discernment improves when you step back from constant adjustment."
      },
      "libra": {
        "overview": "Venus harmonizes with Saturn, bringing structure to your relational world and clarity about which connections deserve your diplomatic energy. Winter's introspection helps you distinguish between peacekeeping and people-pleasing.",
        "love": "Serious conversations about commitment feel natural rather than heavy under this transit. Singles may attract someone whose maturity and stability offer refreshing contrast to past patterns.",
        "career": "Creative projects benefit from disciplined execution and traditional approaches. Your aesthetic sense combined with practical application creates work of lasting value.",
        "advice": "Balance is not always found in the middle; sometimes fairness requires taking a clear side. Trust your values to guide decisions when harmony proves impossible."
      },
      "scorpio": {
        "overview": "Pluto's continued journey through transformative territory keeps your evolution process active, while this week's Mars-Neptune square adds emotional complexity to your power moves. The depths call you to explore what you've been avoiding.",
        "love": "Intensity runs high, demanding absolute honesty even when truth feels uncomfortable. Superficial exchanges leave you cold; you need connection that touches the soul's bedrock.",
        "career": "Power dynamics at work require careful navigation as hidden agendas surface under Neptune's revealing light. Your investigative nature helps you read between lines others miss.",
        "advice": "True transformation requires releasing control, not tightening your grip. Trust that what's genuinely yours cannot be lost through vulnerability."
      },
      "sagittarius": {
        "overview": "Jupiter's expansive influence encourages big-picture thinking, though winter's energy counsels tempering enthusiasm with realistic planning. Your philosophical nature finds rich material in this season's introspective mood.",
        "love": "Adventure in relationship may mean exploring emotional depths rather than physical distances right now. Growth comes through understanding, not just experiencing.",
        "career": "Educational pursuits or international connections show promise despite slower winter rhythms. Plant seeds now for journeys that will unfold when spring arrives.",
        "advice": "Wisdom sometimes requires staying put long enough to integrate lessons rather than rushing toward the next experience. Depth and breadth both have value."
      },
      "capricorn": {
        "overview": "Saturn in your sign continues building character through challenges that prove your legendary resilience. This week offers tangible progress on goals you've been steadily climbing toward all winter.",
        "love": "Emotional walls serve protection but can become prisons if never lowered for trustworthy souls. The Venus-Saturn trine invites you to let someone prove their consistency.",
        "career": "Your methodical approach receives recognition from those who matter most in your professional sphere. Advancement comes through demonstrated reliability rather than flashy performance.",
        "advice": "Ambition is your gift, but remember to celebrate milestones rather than immediately focusing on the next summit. You've earned acknowledgment of how far you've climbed."
      },
      "aquarius": {
        "overview": "Uranus, your ruling planet, forms challenging aspects that disrupt even your comfort with change. This week asks whether your rebellious nature serves liberation or simply reactions against constraint.",
        "love": "The tension between independence and intimacy reaches a critical point requiring honest self-examination. True freedom includes the choice to commit, not just to flee.",
        "career": "Innovative ideas meet resistance from traditional structures, testing your ability to work within systems while pushing boundaries. Strategic revolution proves more effective than outright rebellion.",
        "advice": "Progress sometimes requires working with existing frameworks rather than dismantling everything. Choose your battles based on what actually serves the future you envision."
      },
      "pisces": {
        "overview": "The Sun illuminates your sign while Neptune continues its long journey through your spiritual waters, amplifying both intuition and potential for escapism. Winter's introspection suits your contemplative nature perfectly.",
        "love": "Boundaries between self and other blur dangerously easily under Neptune's influence—beautiful for merging but risky for losing yourself. Compassion works best when paired with clarity.",
        "career": "Creative and healing professions benefit from your heightened sensitivity to subtle energies others miss. Practical implementation requires conscious effort to ground your visions.",
        "advice": "Your empathy is profound gift, but you cannot save everyone by drowning alongside them. Strengthen your energetic boundaries without closing your compassionate heart."
      }
    }
  },
  "monthly": {
    "month": "2026-02",
    "horoscopes": {
      "aries": {
        "overview": "February brings a powerful shift in your professional trajectory as Mars moves through your tenth house of career and public image. The first two weeks favor bold initiatives, while the latter half is ideal for consolidating gains and building alliances.",
        "love": "Romantic connections heat up after the 14th when Venus enters your seventh house. Single Aries may find love through professional or networking events. Couples deepen their bond through shared goals and mutual support.",
        "career": "A major career milestone arrives mid-month. Your assertive energy and willingness to take calculated risks set you apart from the competition. A leadership opportunity emerges that could define your professional trajectory for years to come.",
        "health": "High energy levels serve you well, but watch for burnout in the third week. Incorporate stress-relief practices like exercise or meditation. Mars energy benefits from physical outlets — try a new sport or fitness challenge.",
        "advice": "Trust the process and stay patient. February rewards those who combine boldness with strategic thinking. Your ambition is your greatest asset this month."
      },
      "taurus": {
        "overview": "February is a month of steady financial growth and intellectual expansion for Taurus. Venus harmonizes with Saturn throughout the month, creating a stable foundation for long-term investments and meaningful relationships.",
        "love": "Your sensual nature is heightened this month. Physical affection and quality time strengthen existing bonds. A romantic getaway or intimate dinner around the 20th creates lasting memories. Single Taurus attracts partners who appreciate depth.",
        "career": "Financial acumen is your superpower in February. Investments made now have long-term potential. A salary negotiation or business proposal finds favorable ground after the 10th. Trust your instinct for value.",
        "health": "Focus on nutrition and sensory wellness. Your body responds well to nourishing foods, massage, and time in nature. A new wellness routine started this month has lasting benefits.",
        "advice": "Embrace change without abandoning your values. February asks you to grow while staying rooted in what matters most to you."
      },
      "gemini": {
        "overview": "February sparkles with social energy and intellectual stimulation for Gemini. Mercury's favorable position amplifies your communication gifts, making this an ideal month for networking, learning, and sharing your ideas with a wider audience.",
        "love": "Flirtatious energy is high all month. Your wit and charm attract multiple admirers. The key is depth over breadth — invest in the connection that stimulates both your mind and heart. Mid-month conversations reveal important truths.",
        "career": "Writing, speaking, and media opportunities flourish. A presentation or pitch around the 15th could be a turning point. Your ability to synthesize information and present it engagingly sets you apart in your field.",
        "health": "Nervous energy needs healthy outlets. Mindfulness practices, especially breathwork, help calm your racing mind. Social activities that involve movement — dancing, group sports — satisfy both your social and physical needs.",
        "advice": "Commit to one idea and see it through. Your versatility is a strength, but February rewards focused execution over scattered exploration."
      },
      "cancer": {
        "overview": "February invites deep emotional healing and family strengthening for Cancer. The lunar cycles this month create powerful windows for releasing old patterns and welcoming new beginnings in your most intimate relationships.",
        "love": "Emotional vulnerability becomes your greatest romantic asset. Sharing your true feelings without a protective shell invites deeper intimacy. The Full Moon on the 18th illuminates relationship dynamics that need attention.",
        "career": "Your nurturing leadership style gains recognition at work. A project involving customer care, team building, or community outreach highlights your strengths. Real estate or home-related ventures are especially favored.",
        "health": "Emotional and physical health are deeply connected this month. Comfort eating may increase with stress — find nourishing alternatives. Water activities like swimming or hot baths are especially therapeutic.",
        "advice": "Release the need to protect everyone around you. This month, let others care for you as generously as you care for them."
      },
      "leo": {
        "overview": "February is a month of creative renaissance and romantic expression for Leo. The Sun's journey through your chart ignites your artistic talents and draws admiring attention from all directions. Your natural magnetism is at its peak.",
        "love": "Romance flourishes with dramatic flair this month. Grand gestures, heartfelt declarations, and creative expressions of love define your romantic landscape. Valentine's season is your time to shine — plan something unforgettable.",
        "career": "Creative projects reach completion or gain significant momentum. Entertainment, arts, education, and children-related fields are especially favored. Your leadership charisma inspires your entire team to perform at their best.",
        "health": "Your vitality is strong, but don't neglect your heart — both emotionally and physically. Cardiovascular exercise and activities that bring joy are your best medicine. Spend time outdoors when possible.",
        "advice": "Share your creative gifts generously. February rewards Leos who uplift others with their warmth, talent, and irrepressible spirit."
      },
      "virgo": {
        "overview": "February brings practical improvements and health breakthroughs for Virgo. Mercury's analytical power helps you optimize every area of your life, from daily routines to career strategies. Small, consistent changes yield remarkable results.",
        "love": "Love grows through reliability and thoughtful gestures this month. Showing up consistently means more than any grand romantic display. Health-focused activities with a partner strengthen both your bond and your wellness.",
        "career": "Your organizational skills save the day on more than one occasion this month. A complex project benefits from your systematic approach. Professional development opportunities around the 12th are worth pursuing.",
        "health": "This is your wellness power month. Diet adjustments, exercise routines, and health screenings started now produce excellent results. Pay attention to digestive health and stress management techniques.",
        "advice": "Let go of perfectionism and embrace progress. February teaches that consistent improvement matters more than flawless execution."
      },
      "libra": {
        "overview": "February centers on partnership harmony and creative collaboration for Libra. Venus blesses your relationships with beauty and grace, while Saturn provides the structure to make creative visions real. Balance is not just your goal — it is your gift.",
        "love": "Valentine's month is especially magical for Libra. Existing partnerships reach a new level of mutual understanding and aesthetic harmony. Single Libras attract balanced, attractive partners through cultural events and social gatherings.",
        "career": "Collaborative ventures thrive this month. Your diplomatic nature resolves a workplace conflict that others found impossible. Creative industries, law, and design fields are especially favorable. Contracts signed after the 10th have lasting value.",
        "health": "Balance in health mirrors balance in life. Alternate active and restful days. Your kidneys and lower back benefit from extra attention — stay hydrated and practice gentle stretching.",
        "advice": "Make the decision you have been deliberating. February provides the clarity and courage you need to choose and commit wholeheartedly."
      },
      "scorpio": {
        "overview": "February is a month of profound transformation and hidden power for Scorpio. Pluto's influence reveals what lies beneath the surface, while Mars provides the courage to act on deep truths. Financial and emotional resources undergo positive restructuring.",
        "love": "Passionate intensity defines your romantic life this month. Superficial connections fall away as you seek authentic soul-level bonds. A vulnerable conversation around the 20th has the power to transform a relationship forever.",
        "career": "Strategic thinking and investigative skills lead to a major professional breakthrough. Research, finance, therapy, and crisis management are especially favored. A hidden opportunity reveals itself to those who look beneath the surface.",
        "health": "Detoxification — physical, emotional, and digital — serves you powerfully this month. Release what no longer serves your highest good. Intense exercise provides a healthy outlet for Scorpio's potent energy.",
        "advice": "Transformation requires surrender. Release control over outcomes and trust that what emerges from the depths will be more powerful than what you planned."
      },
      "sagittarius": {
        "overview": "February expands your horizons through travel, education, and philosophical exploration. Jupiter's generous influence opens doors to international connections, academic achievements, and spiritual growth that broadens your worldview.",
        "love": "Adventurous romance is on the menu this month. A travel companion becomes a romantic interest, or a partner suggests an exciting new experience together. Cross-cultural connections are especially favored after the 14th.",
        "career": "Publishing, education, international business, and travel industries offer exciting opportunities. Your big-picture vision impresses decision-makers. A mentorship role — giving or receiving — accelerates your professional growth.",
        "health": "Your hips and thighs benefit from extra attention. Outdoor activities like hiking, horseback riding, or cycling align with your adventurous nature while supporting physical wellness. Travel-related health precautions are worth taking.",
        "advice": "Anchor your expansive vision with practical steps. February's abundance flows to those who combine optimistic dreams with disciplined follow-through."
      },
      "capricorn": {
        "overview": "February consolidates your professional achievements while opening new doors for growth. Saturn's structured energy helps you build upon recent successes, while Pluto's transformative influence continues to reshape your identity and ambitions in powerful ways.",
        "love": "Emotional authenticity deepens your most important relationships. Letting your guard down with a trusted partner creates space for genuine intimacy. Professional respect may evolve into romantic interest for single Capricorns.",
        "career": "Your professional reputation reaches new heights this month. A promotion, public recognition, or significant achievement validates your disciplined approach. Authority figures actively support your advancement. Financial planning yields tangible results.",
        "health": "Bones, joints, and skin deserve extra care this month. Calcium-rich foods, stretching routines, and proper skincare make a noticeable difference. Manage stress through structured relaxation — you work best with a plan, even for rest.",
        "advice": "Celebrate your achievements before climbing the next mountain. February reminds you that joy in accomplishment fuels the next phase of your journey."
      },
      "aquarius": {
        "overview": "February is your birthday season, and the cosmos showers you with renewal energy. Uranus continues to shake up comfortable patterns, while the Sun illuminates your authentic self. Innovation, community, and personal freedom are your guiding themes.",
        "love": "Your unique personality is especially attractive this month. Someone who appreciates your unconventional nature may appear unexpectedly. Existing relationships benefit from intellectual stimulation and shared humanitarian interests.",
        "career": "Technology, social media, and innovation-driven projects receive cosmic support. Your ability to envision the future gives you a competitive edge. Team leadership roles suit you well — your democratic approach inspires loyalty and creativity.",
        "health": "Circulation and ankle health deserve attention. Electric or alternative healing modalities resonate with your energy. Group fitness activities or technology-assisted wellness tracking appeal to your innovative nature.",
        "advice": "Ground your revolutionary ideas in human connection. February's greatest breakthroughs come when brilliant innovation serves genuine community needs."
      },
      "pisces": {
        "overview": "February is a deeply spiritual and creative month for Pisces, as your birthday season approaches. Neptune amplifies your intuitive gifts, while Venus adds beauty and harmony to everything you touch. Artistic expression and compassionate service define this period.",
        "love": "Soulmate energy is powerful this month. Existing relationships reach transcendent levels of understanding and compassion. Single Pisces may experience love at first sight or a karmic reconnection that feels destined.",
        "career": "Creative industries, healing professions, music, film, and spiritual services are especially blessed. Your empathic abilities help you understand exactly what people need. A project combining creativity with compassion becomes your signature achievement.",
        "health": "Feet, lymphatic system, and immune function benefit from attention. Gentle exercise like yoga, tai chi, or swimming aligns with your water-sign nature. Sleep quality is essential — create a serene bedtime routine.",
        "advice": "Set boundaries to protect your sensitive energy. February's cosmic gifts flow most freely when you honor your need for solitude and spiritual recharging."
      }
    }
  }
}
