{
  "daily": {
    "date": "2026-03-01",
    "horoscopes": {
      "aries": {
        "text": "Mars charges forward in your communication sector, making this the perfect day to speak your truth with confidence. Spring's renewal energy amplifies your natural leadership qualities, so don't hold back from initiating that important conversation. Your pioneering spirit finds fertile ground today.",
        "love": 4,
        "career": 5,
        "health": 3,
        "luckyNumber": 17,
        "luckyColor": "crimson",
        "mood": "energetic"
      },
      "taurus": {
        "text": "Venus whispers sweet opportunities in your financial sector as March begins with promising prospects. The earth beneath your feet feels especially supportive today, encouraging you to plant seeds for long-term growth. Trust your instincts when it comes to matters of value and self-worth.",
        "love": 3,
        "career": 4,
        "health": 4,
        "luckyNumber": 42,
        "luckyColor": "emerald",
        "mood": "grounded"
      },
      "gemini": {
        "text": "Mercury dances through your zone of expansion, filling your mind with exciting possibilities and fresh perspectives. Your curiosity peaks today, making it ideal for learning something new or connecting with diverse voices. The spring air carries messages meant especially for you—stay alert and open.",
        "love": 4,
        "career": 3,
        "health": 4,
        "luckyNumber": 23,
        "luckyColor": "electric blue",
        "mood": "curious"
      },
      "cancer": {
        "text": "The Moon's gentle influence encourages you to retreat and recharge your emotional batteries this Sunday. Spring's arrival reminds you that growth happens both in action and in stillness. Honor your need for cozy spaces and nurturing connections with those who truly understand your sensitive soul.",
        "love": 5,
        "career": 2,
        "health": 3,
        "luckyNumber": 7,
        "luckyColor": "seafoam",
        "mood": "reflective"
      },
      "leo": {
        "text": "The Sun illuminates your sector of shared resources and deep transformation, inviting you to shine your light into previously shadowed areas. Your natural confidence attracts admirers today, but the real magic happens when you're vulnerable enough to let others see your authentic self. Spring crowns you with renewed vitality.",
        "love": 5,
        "career": 4,
        "health": 5,
        "luckyNumber": 91,
        "luckyColor": "gold",
        "mood": "confident"
      },
      "virgo": {
        "text": "Mercury's analytical gift helps you see patterns others miss as you organize your life for the season ahead. Today's energy favors practical planning over grand gestures, so focus on the details that will make your spring flourish. Your methodical approach to wellness pays dividends now.",
        "love": 3,
        "career": 5,
        "health": 4,
        "luckyNumber": 56,
        "luckyColor": "charcoal",
        "mood": "focused"
      },
      "libra": {
        "text": "Venus graces your creative sector with artistic inspiration and romantic possibilities. The balance you seek comes not from perfection but from embracing spring's promise of renewal and growth. Partnerships benefit from your diplomatic touch, so mediate any conflicts with your characteristic grace.",
        "love": 5,
        "career": 3,
        "health": 3,
        "luckyNumber": 34,
        "luckyColor": "lavender",
        "mood": "harmonious"
      },
      "scorpio": {
        "text": "Pluto's transformative power stirs deep within, urging you to release what no longer serves your evolution. This first day of March carries potent energy for emotional breakthroughs and profound self-discovery. Trust the intensity of your feelings—they're guiding you toward necessary change.",
        "love": 4,
        "career": 4,
        "health": 2,
        "luckyNumber": 88,
        "luckyColor": "maroon",
        "mood": "intense"
      },
      "sagittarius": {
        "text": "Jupiter expands your horizons exactly when you need it most, filling you with optimism for the adventures ahead. Spring's arrival speaks directly to your wandering soul, promising growth through exploration and experience. Book that trip, start that course, or simply let your mind roam free today.",
        "love": 4,
        "career": 3,
        "health": 5,
        "luckyNumber": 12,
        "luckyColor": "orange",
        "mood": "adventurous"
      },
      "capricorn": {
        "text": "Saturn steadies your ambitions with practical wisdom as you map out your spring goals. The renewal season reminds you that even mountains were once molten—transformation takes time but yields lasting results. Your disciplined approach to both career and personal development attracts recognition from unexpected sources.",
        "love": 2,
        "career": 5,
        "health": 4,
        "luckyNumber": 65,
        "luckyColor": "navy",
        "mood": "ambitious"
      },
      "aquarius": {
        "text": "Uranus sparks your innovative genius, bringing flashes of insight that could revolutionize your approach to old problems. Your unconventional ideas find receptive audiences today, so don't censor your brilliance for the sake of conformity. Spring's fresh energy matches your forward-thinking frequency perfectly.",
        "love": 3,
        "career": 4,
        "health": 3,
        "luckyNumber": 49,
        "luckyColor": "indigo",
        "mood": "innovative"
      },
      "pisces": {
        "text": "Neptune's dreamy influence deepens as your season draws to a close, offering profound spiritual insights and creative visions. March begins with your intuition at peak strength—trust those hunches and honor your need for artistic expression. The veil between worlds feels thin today; pay attention to signs and synchronicities.",
        "love": 5,
        "career": 2,
        "health": 3,
        "luckyNumber": 28,
        "luckyColor": "coral",
        "mood": "intuitive"
      }
    }
  },
  "weekly": {
    "weekOf": "2026-03-01",
    "horoscopes": {
      "aries": {
        "overview": "Mars forms a dynamic trine with Uranus this week, igniting your pioneering spirit and urging you toward bold new ventures. The spring energy amplifies your natural leadership qualities, making this an ideal time to initiate projects that have been simmering in your mind.",
        "love": "Venus dancing through your communication sector brings playful banter and intellectual attraction to the forefront. Single Rams may find themselves drawn to someone who stimulates their mind first, while coupled Aries benefit from honest, passionate conversations.",
        "career": "Your ruling planet's electric connection to Uranus suggests unexpected opportunities that require quick thinking and courage. Take calculated risks now, as your instincts are sharper than usual and innovation is favored over convention.",
        "advice": "Channel your abundant energy into one focused direction rather than scattering it across multiple fronts. Trust your impulses but pair them with strategic timing."
      },
      "taurus": {
        "overview": "Venus, your ruling planet, moves through Pisces, softening your edges and inviting you to dream beyond material concerns. The budding spring season asks you to plant seeds both literally and metaphorically, trusting in gradual, organic growth.",
        "love": "Romance takes on a mystical quality as Venus connects with Neptune, dissolving barriers and inviting deeper soul connections. Allow yourself to be vulnerable and express feelings that usually remain locked in your practical heart.",
        "career": "Mercury's position suggests financial negotiations or contract discussions reach a favorable turning point mid-week. Your natural patience and eye for value serve you well in assessing long-term opportunities versus short-term gains.",
        "advice": "Release your grip on rigid plans and allow the universe to surprise you with better alternatives. Comfort and security can coexist with spontaneity."
      },
      "gemini": {
        "overview": "Mercury's forward momentum through your career sector brings clarity to professional ambitions that felt muddled in recent weeks. The spring renewal energy harmonizes perfectly with your mutable nature, offering multiple pathways for growth and expression.",
        "love": "Communication—your love language—becomes the bridge to deeper intimacy as Mercury forms a supportive aspect to Venus. Express your feelings through words, whether written, spoken, or sung, and watch connections flourish.",
        "career": "Collaborative projects gain traction as your networking abilities shine under favorable planetary configurations. Your ability to synthesize diverse perspectives into cohesive strategies positions you as an invaluable team asset.",
        "advice": "Focus on completing one meaningful project before jumping to the next shiny opportunity. Depth will serve you better than breadth this week."
      },
      "cancer": {
        "overview": "The Moon waxes through nurturing signs this week, amplifying your emotional intelligence and intuitive gifts. Spring's arrival invites you to emerge from your protective shell and share your creative and caring nature more boldly with the world.",
        "love": "Your ruling Moon creates tender aspects that deepen existing bonds and attract kindred spirits into your orbit. Emotional honesty, rather than defensive reactions, opens doors to the intimacy you crave.",
        "career": "A Jupiter aspect suggests expansion in areas where you've been consistently showing up and nurturing growth. Trust that your behind-the-scenes efforts are being noticed by those who matter.",
        "advice": "Set boundaries without guilt, knowing that protecting your energy allows you to give more authentically. Your sensitivity is a strength, not a weakness."
      },
      "leo": {
        "overview": "The Sun's position illuminates your sector of intimacy and transformation, calling you to examine what needs releasing to make room for renewal. This spring week offers you the courage to shed old identities that no longer reflect your evolving majesty.",
        "love": "Passionate energies run high as Mars creates a favorable angle to your sign, increasing both desire and the confidence to pursue what your heart wants. Be generous with affection but also clear about your authentic needs.",
        "career": "Creative projects receive enthusiastic support from superiors or audiences, validating your unique approach and personal flair. Your natural charisma opens doors that credentials alone cannot access.",
        "advice": "Lead with warmth rather than ego, and watch how others naturally gravitate toward your light. True royalty serves as much as it shines."
      },
      "virgo": {
        "overview": "Mercury, your ruling planet, brings mental clarity and organizational prowess to peak levels, allowing you to systemize spring's chaotic growth energy. Planetary alignments favor detailed planning that honors both practical necessities and intuitive insights.",
        "love": "Venus in your partnership sector invites you to soften your critical eye and appreciate the imperfect beauty in yourself and others. Love flourishes when you release the need for perfection and embrace authentic connection.",
        "career": "Your analytical skills solve a complex problem that has stumped colleagues, elevating your professional reputation. Opportunities to mentor or teach others your methodical approach may arise and should be welcomed.",
        "advice": "Balance your gift for discernment with compassion, especially toward yourself. Not everything requires improvement—some things simply need acceptance."
      },
      "libra": {
        "overview": "Venus, your ruling planet, creates harmonious aspects that enhance your natural diplomacy and aesthetic sensibilities. Spring's beauty speaks directly to your soul, inspiring creative expression and a renewed commitment to balance in all areas of life.",
        "love": "Relationship dynamics shift toward greater reciprocity as planetary energies emphasize fairness and mutual appreciation. Single Libras attract potential partners who match their evolved standards, while coupled Libras rediscover equilibrium.",
        "career": "Collaborative ventures and partnership opportunities present themselves under favorable Jupiter influences. Your ability to see multiple perspectives makes you the ideal mediator in workplace conflicts or negotiations.",
        "advice": "Make decisions from your center rather than constantly accommodating others' preferences. True harmony includes honoring your own needs."
      },
      "scorpio": {
        "overview": "Pluto's transformative influence continues its deep work in your psyche while Mars adds intensity to your emotional landscape. This spring week asks you to transmute old pain into wisdom and channel your considerable power toward creation rather than control.",
        "love": "Vulnerability becomes your unexpected superpower as you allow trusted others to witness your depths. The intimacy you've been craving becomes possible when you risk showing the tender soul beneath your protective armor.",
        "career": "Strategic moves made behind the scenes this week position you advantageously for future opportunities. Your research skills and ability to perceive hidden dynamics give you an edge in competitive situations.",
        "advice": "Practice releasing the need to control outcomes and trust in the natural cycles of death and rebirth. Your power multiplies when you flow with transformation rather than resist it."
      },
      "sagittarius": {
        "overview": "Jupiter's expansive energy aligns beautifully with spring's growth momentum, opening your world to new philosophies, places, and people. Your natural optimism receives cosmic validation this week as opportunities align with your highest vision for your life.",
        "love": "Adventurous connections spark as you attract others who share your enthusiasm for life's grand adventure. Honesty and humor—your relationship essentials—flow naturally in both new encounters and established bonds.",
        "career": "A teaching, publishing, or travel opportunity may materialize that perfectly suits your need for meaningful work with broad impact. Your ability to inspire others with your vision becomes a valuable professional asset.",
        "advice": "Ground your expansive dreams with at least one practical action step this week. The arrow must be both aimed and released to reach its target."
      },
      "capricorn": {
        "overview": "Saturn's steady influence combines with spring's renewal energy to help you build structures that support sustainable growth rather than temporary success. Patience, your greatest virtue, is rewarded as long-term investments begin showing tangible results.",
        "love": "Emotional walls soften as you recognize that true strength includes allowing others to support you. Committed relationships deepen through shared responsibilities and building toward common goals.",
        "career": "Your reputation for reliability and excellence attracts recognition from authority figures or opens doors to leadership positions. Strategic career moves made now have lasting impact, so choose with your long-term vision in mind.",
        "advice": "Balance ambition with presence, ensuring you don't climb past the experiences worth savoring. Success means nothing if you're too burdened to enjoy it."
      },
      "aquarius": {
        "overview": "Uranus, your ruling planet, creates electric aspects that stimulate innovation and liberate you from outdated patterns. Spring's arrival mirrors your inner revolution, as you shed old versions of yourself to become more authentically aligned with your unique frequency.",
        "love": "Unconventional connections or experimental relationship structures appeal to your need for freedom within intimacy. Communicate your needs clearly, as partners cannot guess what your visionary mind envisions.",
        "career": "Brilliant ideas strike like lightning this week, particularly regarding technology, social networks, or humanitarian initiatives. Your future-oriented thinking positions you ahead of trends that others haven't yet perceived.",
        "advice": "Ground your revolutionary ideas with practical implementation strategies to avoid remaining perpetually ahead of your time. The future needs you to build bridges from the present."
      },
      "pisces": {
        "overview": "Neptune's mystical influence intensifies as the Sun moves through your sign, heightening intuition and creative inspiration to transcendent levels. This spring week offers you spiritual renewal and the opportunity to manifest dreams into form through inspired action.",
        "love": "Romantic and spiritual love blur beautifully as Venus enhances your already compassionate heart. You attract soul connections that honor your sensitive nature and appreciate your capacity for unconditional love.",
        "career": "Creative and healing professions receive particular blessings as your imagination and empathy combine productively. Trust your intuitive hunches about projects or people, as your psychic antennae are finely tuned now.",
        "advice": "Establish clear boundaries to prevent energetic depletion, as your porous nature absorbs others' emotions easily. Discernment between compassion and martyrdom serves your highest good."
      }
    }
  },
  "monthly": {
    "month": "2026-03",
    "horoscopes": {
      "aries": {
        "overview": "As spring awakens and the Sun enters your sign around March 20th, you're infused with dynamic energy and bold confidence. Mars, your ruling planet, energizes your sector of friendships and future visions, urging you to connect with communities that share your passions. This is your month to initiate, lead, and remind the world why you're the zodiac's trailblazer. The renewal season mirrors your own nature—fearless, pioneering, and always ready for the next adventure.",
        "love": "Venus dancing through your social sector brings romantic opportunities through group settings and shared ideals. If you're coupled, collaborating on a shared dream strengthens your bond; if single, a friendship could evolve into something more intriguing.",
        "career": "Your professional ambitions receive a powerful boost as Mercury enhances communication skills that showcase your leadership abilities. This is the perfect time to pitch bold ideas, launch new projects, or step into a role that demands courage and initiative.",
        "health": "Channel your abundant Mars-driven energy into physical activities that challenge you—competitive sports, intense workouts, or outdoor adventures that honor spring's vitality. Balance your fiery nature with adequate rest to avoid burnout.",
        "advice": "Trust your instincts and take that leap you've been contemplating. Your natural courage is your greatest asset this month, so act decisively while remaining open to collaborative magic."
      },
      "taurus": {
        "overview": "March invites you into a period of introspection before your solar return arrives in late April. Venus, your ruling planet, guides you toward clarifying what truly matters in your values and resources. The first stirrings of spring echo your own earthy rhythm—steady, purposeful, and connected to nature's patient unfolding. Use this time to complete old business and plant seeds for the abundant season ahead.",
        "love": "Romance takes on a more serious, meaningful tone as you seek depth over superficial connections. Existing relationships benefit from honest conversations about long-term security and shared values, while singles attract partners through professional or goal-oriented environments.",
        "career": "Your reputation and public standing receive favorable attention, making this an excellent month for career advancement or recognition. Focus on demonstrating your reliability and expertise, as decision-makers are noticing your consistent dedication.",
        "health": "Ground yourself through sensory experiences—gardening, cooking nourishing meals, or massage therapy that honors your body's wisdom. Your physical wellbeing thrives when you maintain regular routines that connect you to earth's rhythms.",
        "advice": "Release what no longer serves your growth and trust the quiet preparation happening beneath the surface. Like spring's hidden roots, your patient efforts are creating the foundation for future abundance."
      },
      "gemini": {
        "overview": "Expansive energy floods your worldview as Jupiter continues its journey through your sector of philosophy and distant horizons. March brings Mercury, your ruling planet, into dynamic aspects that sharpen your already brilliant communication gifts. Your curiosity is at an all-time high, and spring's renewal invites you to explore new subjects, cultures, or perspectives that broaden your mental landscape. This is a month for learning, teaching, and connecting diverse ideas into innovative patterns.",
        "love": "Intellectual stimulation becomes the pathway to your heart, as you crave conversations that challenge and expand your thinking. Long-distance connections or relationships with people from different backgrounds hold special appeal, while existing partnerships thrive through shared learning adventures.",
        "career": "Professional opportunities may arise through publishing, education, travel, or international connections. Your ability to communicate complex ideas with clarity and charm makes you invaluable in collaborative projects that require innovative thinking.",
        "health": "Mental stimulation is essential, but so is preventing mental exhaustion from information overload. Balance your active mind with breathing exercises, short walks that change your environment, and social connections that rejuvenate rather than drain.",
        "advice": "Say yes to opportunities that stretch your mind and spirit beyond familiar boundaries. Your adaptability is your superpower—use it to weave together seemingly unrelated threads into something brilliantly original."
      },
      "cancer": {
        "overview": "Deep transformation continues as you navigate profound shifts in how you share resources, intimacy, and power with others. The Moon, your ruling planet, moves through its monthly cycle with particular emphasis on your emotional foundations and closest relationships. Spring's renewal asks you to shed protective shells that no longer serve your growth, trusting that vulnerability can lead to profound connection. This is a month of emotional alchemy—transforming fear into trust and loss into wisdom.",
        "love": "Intensity and authenticity define your romantic landscape as superficial connections no longer satisfy your soul's hunger. Existing relationships deepen through honest conversations about shared finances, intimacy, or psychological patterns, while singles attract transformative connections that challenge them to grow.",
        "career": "Financial partnerships, joint ventures, or opportunities involving other people's resources come into focus. Your intuitive understanding of emotional undercurrents gives you an advantage in negotiations or collaborative financial planning.",
        "health": "Honor your cyclical nature and the Moon's rhythms by tracking your energy patterns and emotional needs throughout the month. Water therapy, whether through baths, swimming, or time near natural water sources, provides deep healing.",
        "advice": "Trust the process of release and regeneration unfolding in your life. What feels like an ending is actually making space for a more authentic version of yourself to emerge."
      },
      "leo": {
        "overview": "Relationships take center stage as the cosmos illuminates your partnership sector with focused attention. The Sun's journey through spring signs highlights the balance between your radiant individuality and your connections with significant others. This is a month to shine not just as a solo performer but as part of a dynamic duo or collaborative ensemble. Your generous heart and natural leadership find new expression through partnership rather than purely independent ventures.",
        "love": "Romance flourishes as you discover the joy of truly seeing and being seen by another. Committed relationships reach new levels of mutual appreciation and creative collaboration, while singles attract partners who match their warmth and confidence.",
        "career": "Professional partnerships, client relationships, or collaborative projects bring opportunities for recognition and success. Your ability to inspire others while honoring their contributions creates win-win situations that advance everyone's goals.",
        "health": "Your vitality is strong, but remember that even the Sun needs the Moon—balance your outward-focused energy with moments of reception and rest. Creative expression and playful movement keep your heart, both literal and metaphorical, strong.",
        "advice": "Let others share the spotlight and discover how collaboration amplifies rather than diminishes your light. True leadership includes knowing when to support others' brilliance."
      },
      "virgo": {
        "overview": "March activates your daily routines, health practices, and service-oriented work with renewed purpose and energy. Mercury, your ruling planet, sharpens your already analytical mind, helping you refine systems and improve efficiency in all areas of life. Spring's theme of renewal perfectly aligns with your natural inclination toward purification and optimization. This is your month to implement healthy habits, organize your environment, and offer your considerable skills in meaningful service.",
        "love": "Romance may take a practical turn as you appreciate partners who support your daily wellbeing and share your values around health and routine. Small, thoughtful gestures of service become the language of love, and relationships improve through attention to daily details.",
        "career": "Your meticulous attention to detail and problem-solving abilities make you indispensable at work. This is an excellent time to streamline processes, tackle complex projects, or volunteer your expertise in ways that showcase your analytical gifts.",
        "health": "Your body responds beautifully to refined nutrition, organized exercise routines, and preventive care practices. Listen to the subtle messages your physical vessel communicates, and honor the mind-body connection through practices like yoga or mindful movement.",
        "advice": "Perfection is an illusion, but progress is always possible. Focus on sustainable improvements rather than overwhelming overhauls, trusting that small, consistent changes create lasting transformation."
      },
      "libra": {
        "overview": "Creative self-expression and joyful experiences take priority as the cosmos illuminates your sector of pleasure, romance, and artistic pursuits. Venus, your ruling planet, encourages you to embrace what brings authentic delight rather than simply maintaining harmony for others. Spring's arrival invites you to color outside the lines, take romantic risks, and rediscover the playful spirit that may have been buried under responsibilities. This is a month to remember that beauty and joy are not luxuries but essential nutrients for your soul.",
        "love": "Romance blooms with cinematic intensity as your natural charm and grace reach peak magnetism. Existing relationships benefit from injecting more play, spontaneity, and creative expression, while singles attract attention through their artistic or social pursuits.",
        "career": "Creative projects, presentation skills, or work involving aesthetics, entertainment, or children bring opportunities for recognition. Your diplomatic abilities help you navigate workplace dynamics while advancing initiatives that require both vision and collaboration.",
        "health": "Joy is medicine—prioritize activities that make your heart sing and your spirit soar. Balance your social nature with adequate rest, and consider creative movement like dance that combines physical activity with artistic expression.",
        "advice": "Give yourself permission to prioritize pleasure without guilt. Your wellbeing depends on feeding your soul with beauty, creativity, and experiences that remind you why life is worth celebrating."
      },
      "scorpio": {
        "overview": "Your attention turns inward toward home, family, and emotional foundations as March emphasizes your private sanctuary and deepest roots. Pluto, your modern ruling planet, continues its transformative work on your sense of identity and personal power. Spring's renewal energy invites you to clear emotional clutter from your domestic space and psyche, creating room for new growth from the ground up. This is a month for deep feeling, ancestral healing, and strengthening the foundation from which all else in your life grows.",
        "love": "Intimacy deepens through vulnerability and emotional availability rather than passionate intensity alone. Sharing your private world and inner feelings strengthens bonds, while creating a beautiful, secure home environment enhances romantic connection.",
        "career": "Behind-the-scenes work, research, or projects you can develop from a home base prove most productive. Your psychological insight and investigative abilities give you an edge in understanding hidden dynamics or developing strategies away from public scrutiny.",
        "health": "Emotional health is the gateway to physical wellbeing this month—address unprocessed feelings through journaling, therapy, or trusted confidants. Create a home environment that feels like a healing sanctuary supporting your deepest restoration.",
        "advice": "Trust the power of retreat and introspection. The most profound transformations happen in darkness and privacy, like seeds germinating underground before they break through to light."
      },
      "sagittarius": {
        "overview": "Communication, learning, and local connections energize your March as Jupiter, your ruling planet, continues expanding your daily experiences and curious mind. Your natural enthusiasm finds expression through teaching, writing, or sharing your philosophical insights in accessible ways. Spring's arrival mirrors your own optimistic spirit—eager to explore, connect, and discover what lies just beyond the next horizon. This is a month for short journeys, stimulating conversations, and gathering information that feeds your ever-growing wisdom.",
        "love": "Intellectual connection and good humor form the foundation of romantic appeal this month. Relationships thrive through engaging conversations, shared learning experiences, and maintaining enough freedom to explore individual interests while staying connected.",
        "career": "Communication-based projects, marketing, teaching, or sales activities bring opportunities for growth. Your ability to inspire others with your vision and enthusiasm makes you an effective spokesperson for ideas or initiatives requiring passionate advocacy.",
        "health": "Keep your restless energy moving through varied physical activities that prevent boredom—hiking new trails, trying different workout classes, or active social sports. Mental stimulation is as important as physical exercise for your overall wellbeing.",
        "advice": "Stay curious and open to learning from unexpected sources. The wisdom you seek may arrive through casual conversations or nearby adventures rather than distant quests."
      },
      "capricorn": {
        "overview": "Financial security, personal resources, and self-worth occupy your focus as March illuminates what you value most deeply. Saturn, your ruling planet, continues its sobering but supportive work on building sustainable structures in your life. Spring's theme of new growth takes practical form for you—planting seeds that will yield tangible results through patient cultivation. This is a month to assess your resources honestly, invest in quality over quantity, and remember that true security comes from within before it manifests externally.",
        "love": "Relationships are evaluated through the lens of stability, loyalty, and shared values around security and resources. Demonstrating love through practical support and building toward shared material goals strengthens partnerships rooted in reality.",
        "career": "Your reputation for reliability and competence attracts opportunities to increase income or advance professionally. Focus on showcasing your expertise, negotiating fair compensation, and building financial foundations that support long-term ambitions.",
        "health": "Your body appreciates quality nutrition, structured routines, and traditional wellness practices that have stood the test of time. Address dental or bone health, and remember that sustainable self-care is built through consistent small practices rather than extreme measures.",
        "advice": "Trust in slow, steady progress over quick wins. Your commitment to building something lasting will be rewarded, even if results don't appear as rapidly as you'd like."
      },
      "aquarius": {
        "overview": "Your solar return season extends its glow into March as the cosmos highlights your personal identity, appearance, and fresh starts. Uranus, your modern ruling planet, continues revolutionizing your domestic sphere and emotional foundations, asking you to balance innovation with security. Spring's renewal perfectly aligns with your own reinvention—this is your time to debut a new version of yourself that honors both your unique genius and your human need for belonging. March invites you to lead with authenticity while building bridges of connection.",
        "love": "Your magnetic individuality attracts attention and admiration, drawing potential partners who appreciate your unconventional perspective. Existing relationships thrive when you're given freedom to be authentically yourself while maintaining emotional connection and presence.",
        "career": "Personal initiatives, leadership opportunities, or projects that showcase your innovative thinking and humanitarian vision bring recognition. Your ability to see future trends positions you as a valuable asset in progressive environments.",
        "health": "Honor your unique constitution by experimenting with wellness approaches that might seem unconventional but resonate with your individual needs. Community fitness or group wellness activities satisfy your social nature while supporting physical health.",
        "advice": "Balance your natural independence with the recognition that meaningful connection enriches rather than constrains your freedom. You can be both unique and understood."
      },
      "pisces": {
        "overview": "As the Sun moves through your sign until March 20th, you're immersed in profound spiritual renewal and intuitive downloads. Neptune, your ruling planet, continues dissolving boundaries in your communication sector, enhancing your already empathic and artistic expression. This is your season of completion before a new cycle begins—a time for rest, reflection, and honoring the mystical dimensions of existence. March invites you to trust your dreams, both literal and metaphorical, as they contain wisdom about your soul's next chapter.",
        "love": "Romance carries a dreamy, almost fated quality as your sensitivity and compassion reach peak expression. Spiritual or creative connections deepen relationships, though you must maintain healthy boundaries to avoid losing yourself in another person's needs or energy.",
        "career": "Behind-the-scenes work, creative projects, or roles involving healing, spirituality, or the arts align with your current energy. Your intuitive understanding of emotional undercurrents makes you valuable in situations requiring empathy and imagination.",
        "health": "Your permeable boundaries require extra protection through adequate sleep, time near water, and limiting exposure to harsh environments or energies. Practices like meditation, gentle yoga, or sound healing support your sensitive nervous system.",
        "advice": "Honor the sacred pause before new beginnings by resting, releasing, and trusting the invisible realm where transformation gestates. What seems like an ending is actually preparing space for rebirth."
      }
    }
  }
}
